Repository: OpenEmu/OpenEmu
Catalog: OpenEmu/*.lproj/Debug.strings
Languages: ca, es, it

source: General
it: Generali

source: Debug Mode
ca: Mode de depuració
es: Modo depurar
it: Modalità di debug

source: Setup Assistant has finished
ca: L'assistent de configuració ha acabat
es: Asistente de configuración ha finalizado
it: L'assistente iniziale è terminato

source: Region:
ca: Regió:
es: Región:
it: Zona geografica:

source: Run games using:
ca: Executeu els jocs utilitzant:
es: Ejecutar juegos usando:
it: Esegui giochi usando:

source: Library Window
ca: Finestra de la biblioteca
es: Ventana de biblioteca
it: Finestra della libreria

source: Reset main window size
ca: Restableix la mida de la finestra principal
es: Restablecer tamaño de ventana principal
it: Reimposta dimensioni finestra principale

source: Download missing artwork on the fly
ca: Baixa les imatges que faltin sobre la marxa
es: Descargar carátula no encontrada al instante
it: Scarica automaticamente le illustrazioni mancanti

source: Show game titles instead of rom names
ca: Mostra el nom dels jocs en comptes del nom dels fitxers ROM
es: Mostrar títulos de juegos en lugar de nombres de roms
it: Mostra titoli dei giochi al posto dei nomi delle ROM

source: Manually choose system on import
ca: Selecciona el sistema manualment durant la importació
es: Elegir sistema manualmente al importar
it: Scegli manualmente un sistema quando importi un gioco

source: Show autosave states in save state category
ca: Mostra les partides desades automàticament a la categoria de les partides desades
es: Mostrar guardado automático de estados en categoría de estado guardado
it: Mostra i salvataggi emulazione automatici nella cat. Salvataggi

source: Show quicksave states in save state category
ca: Mostra les partides desades ràpidament a la categoria de les partides desades
es: Mostrar guardado rápido de estados en categoría de estado guardado
it: Mostra i salvataggi emulazione veloci nella categoria Salvataggi

source: Show game scanner view
ca: Mostra la visualització de l'escàner de jocs
es: Mostrar vista de análisis de juego
it: Mostra la vista Scanner Giochi

source: Hide game scanner view
ca: Amaga la visualització de l'escàner de jocs
es: Ocultar vista de análisis de juego
it: Nascondi la vista Scanner Giochi

source: HUD Bar / Gameplay
ca: Barra HUD / Joc
es: Barra HUD / Modo de juego
it: Barra HUD / Modalità di gioco

source: Can delete save states
ca: Això pot esborrar les partides desades
es: Poder eliminar estados guardados
it: Abilita eliminazione salvataggi emulazione

source: Show options button
ca: Mostra el botó d'opcions
es: Mostrar botón opciones
it: Mostra il pulsante Opzioni

source: Show notifications during gameplay
ca: Mostra notificacions mentre jugueu
es: Mostrar notificaciones durante modo de juego
it: Mostra le notifiche durante il gioco

source: Use quicksave slots
ca: Utilitza els espais del desat ràpid
es: Usar ranuras de guardado rápido
it: Usa slot salvataggi veloci

source: Show quicksave in menu
ca: Motra el desat ràpid al menú
es: Mostrar guardado rápido en menú
it: Mostra salvataggi veloci nel menu

source: Show autosave in menu
ca: Mostra el desat automàtic al menú
es: Mostrar guardado automático en menú
it: Mostra salvataggi automatici nel menu

source: Show audio output device in menu
ca: Mostra el dispositiu de sortida del so al menú
es: Mostrar dispositivo de entrada de audio en menú
it: Mostra dispositivi di uscita audio nel menu

source: Take screenshots in native size
ca: Fes les captures de pantalla en la mida nativa
es: Hacer capturas de pantalla en tamaño original
it: Scatta le istantanee nelle dimensioni originali

source: Disable aspect ratio correction in screenshots
ca: Desactiva la correcció de la relació de l'aspecte
es: Desactivar corrección de relación de aspecto en capturas de pantalla
it: Disattiva la correzione del rapporto d'aspetto nelle istantanee

source: Game View Background color:
ca: Color de fons de la vista del joc:
es: Color de fondo de vista de juego:
it: Colore di sfondo schermata di gioco:

source: Controls Setup
ca: Configuració dels controls
es: Configuración de mandos
it: Opzioni pannello controlli

source: WiiRemote support (requires relaunch)
ca: Suporta el WiiRemote (requereix reinici)
es: Compatible WiiRemote (necesita reiniciar)
it: Supporto WiiRemote (richiede il riavvio di OpenEmu)

source: Clicking on image selects button
ca: En fer clic a la imatge es selecciona el botó
es: Al hacer clic sobre la imagen marca botón
it: Seleziona i pulsanti facendo clic sull'immagine

source: Clicking outside image deselects button
ca: En fer clic fora de la imatge es deselecciona el botó
es: Al hacer clic fuera de la imagen desmarca botón
it: Deseleziona i pulsanti facendo clic fuori dall'immagine

source: Select first field after setting the last
ca: Seleccioneu el primer camp després de selecionar l'últim
es: Seleccionar primer campo después de configurar el último
it: Seleziona il primo campo dopo aver impostato l'ultimo

source: Draw button mask above image
ca: Dibuixa la màscara del botó a sobre de la imatge
es: Dibujar máscara sobre imagen del botón
it: Mostra la maschera dei pulsanti sull'immagine

source: Log HID Events
ca: Registra els esdeveniments del dispositiu d'interfície humana
es: Registro de eventos de HID
it: Attiva log eventi HID

source: Log Keyboard Events
ca: Registra els esdeveniments del teclat
es: Registro de eventos de teclado
it: Attiva log eventi tastiera

source: Show all global keys
ca: Mostra totes les tecles globals
es: Mostrar todas las teclas genéricas
it: Mostra tutti i controlli globali

source: Set default save states directory
ca: Defineix el directori de les partides desades
es: Establecer carpeta predeterminada de estados guardados
it: Reimposta cartella dei salvataggi emulazione

source: Choose save states directory…
ca: Trieu el directori de les partides desades…
es: Elegir carpeta de estados guardados…
it: Scegli cartella dei salvataggi emulazione…

source: Cleanup autosave state
ca: Neteja les partides desades automàticament
es: Limpiar estados guardados automaticos
it: Ripulisci salvataggi emulazione automatici

source: Cleanup Save States
ca: Neteja les partides desades
es: Limpiar estados guardados
it: Ripulisci salvataggi emulazione

source: Update OpenVGDB
ca: Actualitza l'OpenVGDB
es: Actualizar OpenVGDB
it: Aggiorna OpenVGDB

source: Cancel OpenVGDB Update
ca: Cancel·la l'actualització de l'OpenVGDB
es: Cancelar actualizar OpenVGDB
it: Annulla aggiornamento di OpenVGDB

source: Database Actions
ca: Accions de la base de dades
es: Opciones de base de datos
it: Operazioni sul database

source: Delete artwork that can be downloaded
ca: Esborra les imatges que es poden baixar
es: Eliminar carátula que puede ser descargada
it: Elimina le illustrazioni che si possono scaricare

source: Download missing artwork…
ca: Baixa les imatges que falten…
es: Descargar carátula no encontrada…
it: Scarica le illustrazioni mancanti…

source: Remove untracked artwork files
ca: Esborra les imatges sense seguiment
es: Borrar archivos de carátulas no indexados
it: Rimuovi i file non tracciati delle illustrazioni

source: Cleanup rom hashes
ca: Neteja les sumes de verificació dels fitxers ROM
es: Limpiar roms fragmentadas
it: Ripulisci gli hash delle ROM

source: Remove duplicated roms
ca: Esborra els fitxers ROM duplicats
es: Borrar roms duplicadas
it: Rimuovi le ROM duplicate

source: Cancel cover sync for all games
ca: Cancel·la la sincronització de caràtules de tots els jocs
es: Cancelar sincronizar carátula para todos los juegos
it: Annulla la sincronizzazione delle copertine per tutti i giochi

source: Perform Sanity Check on Database
ca: Realitza les comprovacions de validesa a la base de dades
es: Realizar comprobación de integridad en base de datos
it: Verifica ora l'integrità del database

source: While performing this operation OpenEmu will be unresponsive.
ca: L'OpenEmu no respondrà durant aquesta operació.
es: Mientras realiza esta operación OpenEmu no responderá.
it: Mentre questa operazione è in corso, OpenEmu smetterà di rispondere.

source: Delete useless image objects
ca: Esborra els objectes d'imatge inútils
es: Eliminar objetos de imagen inservibles
it: Elimina gli oggetti immagine inutili

source: Sync games without artwork
ca: Sincronitza els jocs sense imatges
es: Sincronizar juegos sin carátula
it: Sincronizza i giochi senza illustrazione

source: Threshold for analog controls bound to buttons:
ca: Llindar de la vinculació dels controls analògics amb els botons:
es: Umbral para controles analógicos vinculados a botones:
it: Sensibilità pulsanti associati a controlli analogici:

source: Range: %@ to %@
ca: Interval: %@ a %@
es: Rango: %@ a %@
it: Intervallo valido: %@ ÷ %@

source: Default Value: %@
es: Valor por defecto: %@
it: Valore predefinito: %@

source: Checked
es: Marcado
it: selezionato

source: Unchecked
es: No marcado
it: deselezionato

source: Shaders
it: Shader

source: Clear shader cache
it: Inizializza cache shader

source: Reveal user shader folder
it: Mostra cartella shader personalizzati

source: Appearance:
it: Aspetto:

# Auto (region)
source: Auto
it: Automatica

source: North America
it: America del nord

source: Japan
it: Giappone

source: Europe
it: Europa

source: Other
it: Altre

source: Background Thread
it: Thread in background

source: System
it: Di sistema

source: Dark (default)
it: Scuro (predefinito)

source: Light
it: Chiaro
