Repository: OpenEmu/OpenEmu
Catalog: OpenEmu/*.lproj/Localizable.strings
Languages: ca, es, fr, it, ja, nl, pt

source: %@ copy
ca: Còpia de %@
es: Copia de %@
fr: %@ - copie
it: %@ copia
ja: %@ コピー
nl: %@ kopie
pt: %@ copiar

source: %@ could not be enabled because its plugin was not found.
ca: No s'ha pogut habilitar %@ perquè no s'ha trobat el seu connector.
es: %@ no se ha podido activar porque el plugin no se encontró.
fr: Impossible d’activer %@ car son plugin n’a pas été trouvé.
it: Non è stato possibile attivare %@ perché il suo plugin non è stato trovato.
ja: %@を有効化できませんでした。プラグインが見付かりません。
nl: %@ kon niet worden ingeschakeld omdat zijn plug-in niet werd gevonden.
pt: %@ não pode ser habilitado pois o plugin não foi encontrado.

source: %@ games you add to OpenEmu will appear in this Console Library
ca: Els jocs de %@ que afegiu a l'OpenEmu apareixeran en aquesta biblioteca
es: Los juegos de %@ añadidos a OpenEmu aparecerán en esta biblioteca de consolas
fr: Les jeux %@ ajoutés à OpenEmu apparaîtront dans la bibliothèque de la console
it: I giochi per %@ che importerai in OpenEmu appariranno in questa libreria console.
ja: %@ OpenEmuへ追加されたゲームは、このコンソールライブラリへ表示されます。
nl: %@-spellen die u toevoegt aan OpenEmu zullen in deze consolebibliotheek verschijnen
pt: Os jogos de %@ que você adicionar ao OpenEmu vão aparecer nesta Biblioteca de Consoles

source: A version of this plugin is already loaded
ca: Ja s'ha carregat una versió d'aquest connector
fr: Une version de ce plugin est déjà chargée
it: Una versione di questo plugin è già stata caricata
ja: このプラグインは既にロードされています。
nl: Er is al een versie van deze plug-in geladen
pt: Uma versão deste plugins já foi aberta

source: Add Cheat
es: Añadir truco
fr: Ajouter un code
ja: チートコードを追加
pt: Adicionar Trapaça

source: Add Cheat…
es: Añadir truco…
fr: Ajouter un code de triche…
ja: チートコードを追加…
pt: Adicionar Trapaça

source: Add Cover Art From File…
es: Añadir carátula desde archivo…
ja: カバーアートをファイルから追加…
nl: Voeg omslagafbeelding uit bestand toe…
pt: Adicionar Arte de Capa...

source: Add To Collection
es: Añadir a la colección
ja: コレクションへ追加
nl: Voeg toe aan verzameling
pt: Adicionar à Coleção

source: Add a Wiimote…
ca: Afegeix un Wiimote…
es: Añadir Wiimote…
fr: Ajouter une Wiimote…
it: Collega Wiimote…
ja: Wiimoteを追加…
nl: Voeg een Wiimote toe…
pt: Adicionar um Wiimote…

source: All Games
ca: Tots els jocs
es: Todos los juegos
fr: Tous les jeux
it: Tutti i giochi
ja: 全てのゲーム
nl: Alle spellen
pt: Todos os jogos

source: Are you sure you want to delete %ld save games from your OpenEmu library?
ca: Esteu segur que voleu esborrar %ld partides desades de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar %ld partidas guardadas de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer %ld parties sauvegardées de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare %ld salvataggi dalla Libreria di OpenEmu?
ja: 本当に&ldのセーブデータをOpenEmuライブラリから削除しても宜しいですか？
nl: Weet u zeker dat u %ld opgeslagen spellen wilt verwijderen uit uw OpenEmu-bibliotheek?
pt: Tem certeza que deseja remover %ld jogos salvos de sua biblioteca OpenEmu?

source: Are you sure you want to delete %ld screenshots from your OpenEmu library?
ca: Esteu segur que voleu esborrar %ld captures de pantalla de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar %ld capturas de pantalla de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer %ld captures d’écran de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare %ld istantanee dalla Libreria di OpenEmu?
ja: 本当に%ldのスクリーンショットデータをOpenEmuライブラリから削除しても宜しいですか？
nl: Weet u zeker dat u %ld schermafbeeldingen wilt verwijderen uit uw OpenEmu-bibliotheek?
pt: Tem certeza que deseja remover %ld capturas de tela salvas de sua biblioteca OpenEmu?

source: Are you sure you want to delete the save game called '%@' from your OpenEmu library?
ca: Esteu segur que voleu esborrar la partida desada anomenada '%@' de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar la partida guardada llamada '%@' de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer le jeu « %@ » de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare il salvataggio "%@" dalla Libreria di OpenEmu?
ja: 本当に'%@'という名前のセーブデータをOpenEmuライブラリから削除しても宜しいですか？
nl: Weet u zeker dat u het opgeslagen spel '%@' wilt verwijderen uit uw OpenEmu-bibliotheek?
pt: Tem certeza que deseja remover o salvamento '%@' de sua biblioteca OpenEmu?

source: Are you sure you want to delete the screenshot called '%@' from your OpenEmu library?
ca: Esteu segur que voleu esborrar la captura de pantalla anomenada '%@' de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar la captura de pantalla llamada '%@' de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer la capture d’écran « %@ » de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare l'istantanea "%@" dalla Libreria di OpenEmu?
ja: 本当に'%@'という名前のスクリーンショットデータをOpenEmuライブラリから削除しても宜しいですか？
nl: Weet u zeker dat u de schermafbeelding '%@' wilt verwijderen uit uw OpenEmu-bibliotheek?
pt: Tem certeza que deseja remover a capturas de tela '%@' de sua biblioteca OpenEmu?

source: Are you sure you want to delete the selected game from your OpenEmu library?
ca: Esteu segur que voleu esborrar el joc seleccionat de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar el juego seleccionado de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer le jeu sélectionné de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare il gioco selezionato dalla Libreria di OpenEmu?
ja: 選択したゲームをOpenEmuライブラリから本当に削除しても宜しいですか？
nl: Weet u zeker dat u het geselecteerde spel wilt verwijderen uit uw OpenEmu-bibliotheek?
pt: Tem certeza que deseja remover o jogo selecionado de sua biblioteca OpenEmu?

source: Are you sure you want to delete the selected games from your OpenEmu library?
ca: Esteu segur que voleu esborrar el jocs seleccionats de la biblioteca de l'OpenEmu?
es: ¿Está seguro que desea eliminar los juegos seleccionados de su biblioteca de OpenEmu?
fr: Voulez-vous vraiment supprimer les jeux sélectionnés de votre bibliothèque OpenEmu ?
it: Sei sicuro di voler cancellare i giochi selezionati dalla Libreria di OpenEmu?
ja: 選択したゲームをOpenEmuライブラリから本当に削除しても宜しいですか？
nl: Weet u zeker dat u de geselecteerde spellen wilt verwijderen uit uw OpenEmu-biblioteek?
pt: Tem certeza que deseja remover os jogos selecionados de sua biblioteca OpenEmu?

source: Are you sure you want to quit the application?
ca: Esteu segur que voleu sortir de l'aplicació?
es: ¿Está seguro que desea salir de la aplicación?
fr: Voulez-vous vraiment quitter l’application ?
it: Sei sicuro di voler uscire?
ja: アプリケーションを終了しても宜しいですか？
nl: Weet u zeker dat u de toepassing wilt stoppen?
pt: Tem certeza que deseja sair da aplicação?

source: Are you sure you want to remove the selected games from the collection?
ca: Esteu segur que voleu esborrar els jocs seleccionats de la col·lecció?
es: ¿Está seguro que desea eliminar los juegos seleccionados de la colección?
fr: Voulez-vous vraiment supprimer les jeux sélectionnés de votre collection ?
it: Sei sicuro di voler rimuovere i giochi selezionati da questa raccolta?
ja: 選択したゲームをコレクションから削除しても宜しいですか？
nl: Weet u zeker dat u de geselecteerde spellen wilt verwijderen uit de verzameling?
pt: Tem certeza que deseja remover os jogos selecionados desta coleção?

source: Are you sure you want to remove this collection?
ca: Esteu segur que voleu esborrar aquesta col·lecció?
es: ¿Está seguro que desea eliminar esta colección?
fr: Voulez-vous vraiment supprimer cette collection ?
it: Sei sicuro di voler eliminare questa raccolta?
ja: このコレクションを本当に削除しても宜しいですか？
nl: Weet u zeker dat u deze verzameling wilt verwijderen?
pt: Tem certeza que deseja remover esta coleção?

source: Are you sure you want to reset the console?
ca: Esteu segur que voleu reiniciar la consola?
es: ¿Está seguro que desea reiniciar la consola?
fr: Voulez-vous vraiment réinitialiser la console ?
it: Sei sicuro di voler resettare la console?
ja: コンソールをリセットしますか？
nl: Weet u zeker dat u de console opnieuw wilt instellen?
pt: Tem certeza que deseja reiniciar o console?

source: Are you sure you want to stop emulation?
ca: Esteu segur que voleu aturar l'emulació?
es: ¿Está seguro que desea detener la emulación?
fr: Voulez-vous vraiment arrêter l’émulation ?
it: Sei sicuro di voler arrestare l'emulazione?
ja: エミュレータを停止しますか？
nl: Weet u zeker dat u emulatie wilt stoppen?
pt: Tem certeza que deseja parar a emulação?

source: At least one System must be enabled
ca: Com a mínim un sistema ha d'estar habilitat
es: Al menos un sistema debe estar activado
fr: Au moins un système doit être activé
it: Deve essere attivo almeno un sistema
ja: 最低一つ以上のシステムを有効にして下さい。
nl: Ten minste één systeem moet ingeschakeld zijn
pt: Pelo menos um Sistema deve estar habilitado

source: Auto Save State
ca: Partida desada automàticament
fr: Sauvegarde auto
it: Salvataggio automatico
ja: オートセーブステート
nl: Automatische momentopname
pt: Salvamento automático

source: Automatically Import
ca: Importa automàticament
fr: Importation automatique
it: Importazione Automatica
ja: 自動でインポート
nl: Importeer automatisch
pt: Importar automaticamente

source: Bluetooth Not Enabled
ca: El Bluetooth no està habilitat
es: Bluetooth desactivado
fr: Bluetooth non activé
it: Bluetooth disattivato
ja: Bluetoothが無効になっています。
nl: Bluetooth niet ingeschakeld
pt: Bluetooth não habilitado

source: Bluetooth must be enabled to pair a Wii controller.
ca: Per a aparellar un controlador de la Wii el Bluetooth ha d'estar habilitat.
es: Bluetooth debe estar activado para enlazar un mando de Wii.
fr: Bluetooth doit être activé pour associer une manette Wii.
it: Per collegare un controller Wii, il Bluetooth deve essere attivo.
ja: Wiiコントローラを接続するには、Bluetoothを有効にして下さい。
nl: Bluetooth moet ingeschakeld zijn om een Wii-controller te koppelen.
pt: Bluetooth deve estar habilitado para parear um controle de Wii.

source: COLLECTIONS
es: COLECCIONES
pt: COLEÇÕES

source: Can delete save states
ca: Això pot esborrar les partides desades
fr: Peut supprimer les parties sauvegardées
it: Abilita eliminazione salvataggi emulazione
ja: セーブステートを削除可能にする
pt: Pode deletar salvamentos

source: Cancel
ca: Cancel·la
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
nl: Annuleer
pt: Cancelar

source: Cancel Cover Art Download
ca: Cancel·la la baixada de les caràtules
es: Cancelar descargar carátula
fr: Annuler le téléchargement de l’illustration
it: Annulla scaricamento copertine
ja: カバーアートのダウンロードをキャンセル
nl: Annuleer omslagafbeelding downloaden
pt: Cancelar Download de Arte de Capa

source: Cancel OpenVGDB Update
ca: Cancel·la l'actualització de l'OpenVGDB
es: Cancelar actualizar OpenVGDB
fr: Annuler la mise à jour d’OpenVGDB
it: Annulla aggiornamento di OpenVGDB
ja: OpenVGDBのアップデートをキャンセル
nl: Annuleer OpenVGDB-update
pt: Cancelar Atualização do OpenVGDB

source: Change Core
ca: Canvia el nucli
es: Cambiar núcleo
fr: Changer le cœur
it: Cambia core
ja: コアを変更
nl: Wijzig kern
pt: Mudar Núcleo

source: Change Volume
ca: Canvia el volum
es: Cambiar volumen
fr: Changer le volume
it: Cambia volume
ja: 音量を変更
nl: Wijzig volume
pt: Mudar Volume

source: Cheat Description
ca: Descripció del truc
es: Descripción del truco
fr: Description du code de triche
it: Descrizione trucco
ja: チートの説明
nl: Beschrijving van cheat
pt: Descrição da Trapaça

source: Choose Library…
ca: Trieu la biblioteca…
es: Elegir biblioteca…
fr: Choisir la bibliothèque…
it: Seleziona Libreria…
ja: ライブラリを選択…
nl: Kies bibliotheek…
pt: Escolher Biblioteca...

source: Choose OpenEmu Library
ca: Trieu una biblioteca de l'OpenEmu
es: Elegir biblioteca de OpenEmu
fr: Choisir la bibliothèque OpenEmu
it: Scegli Libreria di OpenEmu
ja: OpenEmuライブラリを選択
nl: Kies OpenEmu-bibliotheek
pt: Escolher Biblioteca OpenEmu

source: Choose a valid file.
ca: Seleccioneu un fitxer vàlid.
fr: Choisir un fichier valide.
it: Scegli un file valido.
ja: 有効なファイルを選択して下さい。
nl: Kies een geldig bestand.
pt: Escolha um arquivo válido.

source: Choose save states directory
pt: Escolha o diretório dos salvamentos

source: Chose Yes to remove all items from the queue. Items that finished importing will be preserved in your library.
es: Elija Si para eliminar todos los ítems de la cola. Los ítems que finalicen la importación se mantendrán en su biblioteca.
pt: Escolha Sim para remover todos os itens da fila. Itens que já foram importados serão mantidos em sua biblioteca.

source: Cleanup autosave state
ca: Neteja les partides desades automàticament
fr: Nettoyer la partie sauvegardée automatiquement
it: Ripulisci salvataggi emulazione automatici
ja: オートセーブステートをクリーンアップ
nl: Ruim staat van momentopnames op
pt: Limpar salvamentos automáticos

source: Clicking on image selects button
ca: En fer clic a la imatge es selecciona el botó
es: Al hacer clic sobre la imagen marca botón
fr: Cliquer sur l’image pour sélectionner le bouton
it: Seleziona i pulsanti facendo clic sull'immagine
ja: 画像をクリックしてボタンを選択
nl: Klikken op afbeelding selecteert knop
pt: Clicar na imagem seleciona o botão

source: Clicking outside image deselects button
ca: En fer clic fora de la imatge es deselecciona el botó
es: Al hacer clic fuera de la imagen desmarca botón
fr: Cliquer hors de l’image pour désélectionner le bouton
it: Deseleziona i pulsanti facendo clic fuori dall'immagine
ja: 画像の外をクリックして選択を解除
nl: Klikken buiten afbeelding deselecteert knop
pt: Clicar fora da imagem remove a seleção do botão

source: Code:
ca: Codi:
es: Código:
it: Codice:
ja: コード:
pt: Código:

source: Collapse
es: Contraer
pt: Minimizar

source: Collections
ca: Col·leccions
es: Colecciones
it: Raccolte
ja: コレクション
nl: Verzamelingen
pt: Coleções

source: Consolidate
ca: Consolida
fr: Consolider
it: Raggruppa
ja: 統合
nl: Voeg samen
pt: Consolidar

source: Consolidate Files…
ca: Consolida els fitxers…
fr: Consolider les fichiers…
it: Raggruppa file…
ja: ファイルを統合する…
nl: Voeg bestanden samen…
pt: Consolidar Arquivos...

source: Consolidating will copy all of the selected games into the OpenEmu Library folder. This cannot be undone.
ca: El procés de consolidació copiarà tots els jocs seleccionats a la carpeta de la biblioteca de l'OpenEmu. Això no es pot desfer.
fr: La consolidation copiera tous les jeux sélectionnés dans le dossier de la bibliothèque OpenEmu. Cette opération est irréversible.
it: I giochi selezionati verranno copiati all'interno della cartella della Libreria di OpenEmu. Questa operazione non può essere annullata.
ja: 統合すると、選択された全てのゲームがOpenEmuライブラリのフォルダへコピーされます。 この操作は取り消せません。
nl: Samenvoegen zal alle geselecteerde spellen kopiëren naar de OpenEmu-bibliotheekmap. Dit kan niet ongedaan worden gemaakt.
pt: Ao Consolidar você copiará todos os jogos selecionados para a Biblioteca do OpenEmu. Isso não pode ser desfeito.

source: Controls
es: Mandos
fr: Contrôles
it: Controlli
ja: コントローラ
nl: Bediening
pt: Controles

source: Controls Setup
ca: Configuració dels controls
es: Configuración de mandos
fr: Configuration des contrôles
it: Opzioni pannello controlli
ja: コントローラー設定
nl: Bedieningsset-up
pt: Configuração dos Controles

source: Copying Artwork Files…
ca: S'estan copiant les imatges…
es: Copiando archivos de carátulas…
fr: Copie des illsutrations…
it: Copia illustrazioni…
ja: カバー写真をコピーしています…
nl: Omslagafbeeldingsbestanden kopiëren…
pt: Copiando Artes de Capa...

source: Copying Game Files…
ca: S'estan copiant els jocs…
es: Copiando archivos de juegos…
fr: Copie des parties…
it: Copia file dei giochi…
ja: ゲームをコピーしています…
nl: Spelbestanden kopiëren…
pt: Copiando Jogos...

source: Copying ROM Files…
ca: S'estan copiant els fitxers ROM…
es: Copiando archivos ROM…
fr: Copie des roms…
it: Copia file ROM…
ja: ROMファイルをコピーしています…
nl: ROM-bestanden kopiëren…
pt: Copiando ROMs...

source: Copying artwork failed!
ca: La còpia de les imatges ha fallat.
es: ¡Falló al copiar carátula!
fr: Échec de la copie des illustrations !
it: Copia dell'illustrazione non riuscita!
ja: カバー写真のコピーに失敗しました。
nl: Omslagafbeelding kopiëren mislukt!
pt: A cópia das Artes de Capa falhou!

source: Core Provided By…
ca: Nucli proveït per…
es: Núcleo proporcionado por…
fr: Cœur fourni par…
it: Core fornito da…
ja: コア提供元…
nl: Kern voorzien door…
pt: Núcleo Fornecido Por

source: Cores
ca: Nuclis
es: Núcleos
fr: Cœurs
it: Core
ja: コア
nl: Kernen
pt: Núcleos

source: Could not move complete library! %ld roms were moved
ca: No s'ha pogut moure la biblioteca completa. S'ha mogut %ld fitxers ROM
es: ¡No ha podido mover la biblioteca completa! %ld roms fueron movidas
fr: Impossible de déplacer la bibliothèque complète ! %ld roms ont été déplacées
it: Non è stato possibile spostare completamente la Libreria! Sono state spostate solo %ld ROM
ja: ライブラリの移動に失敗しました。%ld個のロムを移動しました。
nl: Kon bibliotheek niet geheel verplaatsen! %ld ROM's werden verplaatst
pt: Não foi possível mover toda a biblioteca! %ld roms foram movidas

source: Could not move library data!
ca: No s'ha pogut moure les dades de la biblioteca.
es: ¡No ha podido mover los datos de la biblioteca!
fr: Impossible de déplacer les données de la bibliothèque !
it: Non è stato possibile spostare i dati della Libreria!
ja: ライブラリデータを移動出来ません。
nl: Kon bibliotheekgegevens niet verplaatsen!
pt: Não foi possível mover os dados da biblioteca!

source: Couldn't connect to the background process.
pt: Não foi possível conectar com o processo em background.

source: Couldn't load %@ plugin
ca: No s'ha pogut carregar el connector %@
fr: Impossible de charger le plugin %@
it: Non è stato possibile caricare il plugin %@
ja: %@という名称のプラグインをロード出来ませんでした。
nl: Kon plug-in %@ niet laden
pt: Não foi possível carregar o plugin %@

source: Create Library…
ca: Crea una biblioteca…
es: Crear biblioteca…
fr: Créer une bibiothèque…
it: Crea una Libreria…
ja: ライブラリを作成…
nl: Maak bibliotheek aan…
pt: Criar Biblioteca...

source: Create a personal game selection. To add to a collection, select a game from your console library and drag it to ’%@’ on the left.
ca: Creeu una selecció personal de jocs. Per a afegir un joc a la col·lecció, seleccioneu-lo de la biblioteca i arrossegueu-lo a ’%@’ a l'esquerra.
es: Cree una selección personal de juegos. Para añadir a la colección, seleccione un juego de su biblioteca de consolas y arrástrelo a ’%@’ en la izquierda.
fr: Créer une sélection de jeux personnelle. Pour ajouter un jeu à une collection, sélectionnez-le dans votre bibliothèque de consoles et glissez-le vers « %@ » sur la gauche.
ja: 自分好みのゲームセレクションを作成しましょう。コレクションを追加するには、コンソールライブラリからゲームを選択し、左側の’%@’へドラッグして下さい。
pt: Crie uma seleção pessoal de jogos. Para adicionar a uma coleção, selecione um jogo de sua biblioteca de consoles e arraste-o para o ’%@’ na esquerda.

source: Create or Load Save State
ca: Crea o carrega una partida desada
fr: Créer ou charger une partie sauvegardée
it: Crea o carica salvataggi emulazione
ja: セーブステートを作成/ロードする
nl: Maak of laad momentopname
pt: Crie ou carregue salvamentos

source: DEVICES
es: DISPOSITIVOS
pt: DISPOSITIVOS

source: Dark GridView context menu
ca: Menú contextual de la visualització de graella fosc
fr: Menu contextuel sombre dans la présentation par grille
it: Menu contestuale scuro nella GridView
ja: ダーク・グリッドビュー
pt: Menu contextual GridView Dark

source: Database Actions
ca: Accions de la base de dades
fr: Actions de la base de données
it: Operazioni sul database
ja: データベース操作
nl: Database acties
pt: Ações de Banco de Dados

source: Debug Mode
ca: Mode de depuració
es: Modo depurar
fr: Mode de débogage
it: Modalità di debug
ja: デバッグモード
nl: Debugmodus
pt: Modo Debug

source: Delete Collection
ca: Esborra la col·lecció
es: Eliminar colección
fr: Supprimer la collection
it: Elimina raccolta
ja: コレクションを削除
nl: Verwijder verzameling
pt: Remover Coleção

source: Delete Game
ca: Esborra el joc
es: Eliminar juego
fr: Supprimer jeu
it: Elimina gioco
ja: ゲームを削除
nl: Verwijder spel
pt: Remover Jogo

source: Delete Games
ca: Esborra els jocs
es: Eliminar juegos
fr: Supprimer jeux
it: Elimina giochi
ja: ゲームを削除
nl: Verwijder spellen
pt: Remover Jogos

source: Delete Save
ca: Esborra la partida
fr: Supprimer
it: Elimina
ja: セーブを削除
nl: Verwijder opgeslagen spel
pt: Remover Salvamento

source: Delete Saves
ca: Esborra les partides
fr: Supprimer
it: Elimina
ja: セーブを削除
nl: Verwijder opgeslagen spellen
pt: Remover Salvamentos

source: Delete Screenshot
ca: Esborra la captura de pantalla
es: Eliminar captura de pantalla
fr: Supprimer capture
it: Elimina
ja: スクリーンショットを削除
nl: Verwijder schermafbeelding
pt: Remover Captura de Tela

source: Delete Screenshots
ca: Esborra les captures de pantalla
es: Eliminar capturas de pantalla
fr: Supprimer captures
it: Elimina
ja: スクリーンショットを削除
nl: Verwijder schermafbeeldingen
pt: Remover Capturas de Tela

source: Deselect All
ca: Desselecciona-ho tot
es: Desmarcar todo
fr: Tout désélectionner
it: Deseleziona tutto
ja: 全ての選択を解除
nl: Deselecteer alles
pt: Desmarcar Tudo

source: Device Disconnected
ca: S'ha desconnectat el dispositiu
fr: Périphérique déconnecté
it: Dispositivo scollegato
ja: デバイスの接続を解除
nl: Apparaat ontkoppeld
pt: Dispositivo Desconectado

# Device number %lu, %@, has disconnected.
source: Device number %1$lu, %2$@, has disconnected.
ca: S'ha desconnectat el dispositiu número %lu, %@.
fr: Le périphérique numéro %lu, %@, a été déconnecté.
it: Il dispositivo n° %1$lu, %2$@, si è scollegato
ja: %1$lu, %2$@, 個のデバイスの接続が解除されました。
nl: Apparaat met nummer %1$lu, %2$@, is ontkoppeld.
pt: O dispositivo número %1$lu, %2$@, foi desconectado.

source: Disable aspect ratio correction
fr: Désactiver la correction du rapport d’aspect
ja: アスペクト比調整を無効にする
pt: Desabilitar correção de proporção da tela

source: Disable grid view gloss overlay
pt: Desabilitar efeito de brilho no grid

source: Do Not Save
fr: Ne pas sauvegarder
ja: 保存しない
pt: Não Salvar

source: Do not ask me again
ca: No m'ho tornis a dir
es: No volver a preguntar
fr: Ne plus me demander
it: Non chiedermelo più
ja: 再表示しない
nl: Vraag me dit niet opnieuw
pt: Não perguntar novamente

source: Do not show me again
ca: No m'ho tornis a mostrar
es: No volver a mostrar
fr: Ne plus afficher
it: Non avvisarmi più
ja: 再表示しない
nl: Laat me dit niet opnieuw zien
pt: Não exibir novamente

source: Do you really want to cancel the import process?
ca: Segur que voleu cancel·lar el procés d'importació?
es: ¿Realmente desea cancelar el proceso de importación?
fr: Voules-vous vraiment annuler le processus d’importation ?
ja: インポートをキャンセルしますか？
nl: Wilt u het importproces echt annuleren?
pt: Deseja realmente cancelar o processo de importação?

source: Do you want to continue playing where you left off?
ca: Voleu continuar la partida on la vau deixar?
es: ¿Desea continuar jugando donde lo dejó?
fr: Voulez-vous continuer la partie là où vous l’avez quittée ?
it: Vuoi riprendere a giocare da dove avevi interrotto?
ja: 最後に中断したところから再開しますか？
nl: Wilt u verder spelen waar u geëindigd was?
pt: Deseja continuar jogando de onde você parou?

source: Don't Import Selected
ca: No importis els seleccionats
es: No importar seleccionado
fr: Ne pas importer la sélection
it: Non importare la selezione
ja: インポートしない
nl: Importeer geselecteerde niet
pt: Não importar Selecionados

source: Done
ca: Fet
es: Hecho
fr: Terminé
it: Scansione completata
ja: 完了
nl: Klaar
pt: Pronto

source: Download Cover Art
ca: Baixa la caràtula
es: Descargar carátula
fr: Télécharger l’illustration
it: Scarica copertina
ja: カバー写真をダウンロード
nl: Download omslagafbeelding
pt: Baixar Arte de Capa

source: Download missing artwork on the fly
ca: Baixa les imatges que faltin sobre la marxa
fr: Télécharger l’illustration manquante à la volée
it: Scarica automaticamente le illustrazioni mancanti
ja: ダウンロードした写真が見付かりません
nl: Download ontbrekend artwork wanneer nodig
pt: Baixar artworks automaticamente
