Repository: OpenEmu/OpenEmu
Catalog: OpenEmu/*.lproj/Localizable.strings
Languages: ca, es, fr, it, ja, nl, pt

source: Downloading and Installing Core…
ca: S'està baixant i instal·lant el nucli…
es: Descargando y instalando núcleo…
fr: Téléchargement et installation du cœur…
it: Scaricamento e installazione del core…
ja: コアをダウンロード/インストールしています…
nl: Kern downloaden en installeren…
pt: Baixando e Instalando Núcleo...

source: Drag & Drop Games Here
ca: Arrossegueu i deixeu anar aquí els jocs
es: Arrastrar y soltar juegos aquí
fr: Glissez et déposez des jeux ici
it: Trascina i giochi qui
ja: ここにゲームをドラッグ&ドロップして下さい
pt: Arraste e Solte os Jogos Aqui

source: Draw button mask above image
ca: Dibuixa la màscara del botó a sobre de la imatge
fr: Dessiner un masque de bouton au-dessus de l’image
it: Mostra la maschera dei pulsanti sull'immagine
ja: 画像の上に重なるボタンマスクを作成
nl: Teken knopmasker boven afbeelding
pt: Desenhe a máscara do botão em cima da imagem

source: Duplicate Collection
ca: Duplica la col·lecció
es: Duplicar colección
fr: Dupliquer la collection
it: Duplica raccolta
ja: コレクションを複製
pt: Duplicar Coleção

source: Edit Game Controls
es: Editar controles del juego
fr: Modifier les contrôles de jeu
ja: コントローラを編集
pt: Editar Controles

source: Enable Retrode support
es: Activar compatibilidad Retrode
ja: Retrodeサポートを有効にする
pt: Habilitar suporte ao Retrode

source: Enable now
ca: Habilita ara
es: Activar ahora
fr: Activer maintenant
it: Attiva subito
ja: すぐ有効にする
nl: Schakel nu in
pt: Habilitar agora

source: Error!
ca: S'ha produït un error.
fr: Erreur !
it: Errore!
ja: エラー!
nl: Fout!
pt: Erro!

# Game %ld of %ld
source: Game %1$ld of %2$ld
ca: Joc %1$ld de %2$ld
es: Juego %1$ld de %2$ld
fr: Jeu %ld sur %ld
it: Gioco %1$ld di %2$ld
ja: ゲーム %1$ld 個中 %2$ld
nl: Spel %1$ld van %2$ld
pt: Jogo %1$ld de %2$ld

source: Game Scanner
ca: Escàner de jocs
fr: Analyse des jeux
it: Scanner giochi
ja: ゲームスキャナー
nl: Spellenscanner
pt: Scanner de Jogos

source: Game View Background color
ca: Color de fons de la vista del joc
fr: Couleur de fond de l’affichage du jeu
it: Colore di sfondo della schermata di gioco
ja: ゲーム画面の背景色
nl: Achtergrondkleur van spellenvenster
pt: Cor de Fundo do Game View

source: General
fr: Général
it: Generali
ja: 一般
nl: Algemeen
pt: Geral

source: HUD Bar / Gameplay
ca: Barra HUD / Joc
fr: Barre HUD / Jeu
it: Barra HUD / Modalità di gioco
ja: HUDバー / ゲームプレイ
nl: HUD-balk/Spelen
pt: Barra de Informações / Gameplay

source: Hide "%@"
ca: Amaga "%@"
es: Ocultar "%@"
fr: Masquer « %@ »
it: Nascondi "%@"
ja: "%@"を隠す
nl: Verberg "%@"
pt: Esconder "%@"

source: If there is a red button on the back battery cover, press it. If not, hold down buttons ①+②.
ca: Si hi ha un botó vermell al darrere de la tapa de la bateria, premeu-lo. Si no, manteniu premuts els botons ①+②.
es: Si hay un botón rojo en la tapa trasera de la batería, púlselo. Si no, mantenga pulsados los botones ①+②.
fr: Si un bouton rouge est présent sur le couvercle des piles, appuyez dessus. Sinon, maintenez enfoncés les boutons ①+②.
it: Se c'è un pulsante rosso sul retro, premilo. Altrimenti, tieni premuti insieme i pulsanti ① e ②.
ja: 背面のバッテリーカバーに赤いボタンがある場合は押して下さい。 そうでない場合は①+②ボタンを押し続けて下さい。
nl: Als er een rode knop op de achterste batterijcover is, druk hem dan in. Zoniet, hou dan de knoppen ①+② ingedrukt.
pt: Se houver um botão vermelho atrás da capa da tampa da bateria, aperte-o. Senão, seguro os botões ①+②.

source: If you change the core you current progress will be lost and save states will not work anymore.
ca: Si canvieu el nucli el progrés es perdrà i les partides desades deixaran de funcionar.
fr: Si vous changez de cœur, votre progression en cours sera perdue et les parties sauvegardées ne fonctionneront plus.
it: Cambiando il core i progressi attuali nel gioco saranno persi e i vecchi salvataggi emulazione smetteranno di funzionare.
ja: コアを変更すると、現在までの進行が失われ、セーブステートも無効になります。
nl: Als u de kern wijzigt verliest u uw huidige voortgang en zullen momentopnames niet langer werken.
pt: Se você mudar o Núcleo do console, seu progresso será perdido e seus salvamentos não irão mais funcionar.

source: Install
ca: Instal·la
es: Instalar
fr: Installer
it: Installa
ja: インストール
nl: Installeer
pt: Instalar

source: Installing Core
ca: S'està instal·lant el nucli
fr: Installation du cœur
it: Installazione core
ja: コアをインストール
nl: Kern installeren
pt: Instalando Núcleo

source: Keep Files
ca: Conserva els fitxers
es: Mantener archivos
fr: Conserver
it: Mantieni i file
ja: ファイルを保持
nl: Bestanden behouden
pt: Manter Arquivos

source: Keyboard
ca: Teclat
es: Teclado
fr: Clavier
it: Tastiera
ja: キーボード
nl: Toetsenbord
pt: Teclado

source: Library
ca: Biblioteca
es: Biblioteca
fr: Bibliothèque
it: Libreria
ja: ライブラリ
nl: Bibliotheek
pt: Biblioteca

source: Library Window
ca: Finestra de la biblioteca
es: Ventana de biblioteca
fr: Fenêtre de la bibliothèque
it: Finestra della libreria
ja: ライブラリ ウィンドウ
nl: Bibliotheekvenster
pt: Janela de Biblioteca

source: Locate
ca: Troba
es: Buscar
fr: Localiser
it: Trova
ja: 場所
nl: Vind
pt: Localizar

source: Locate '%@'
ca: Troba '%@'
es: Buscar '%@'
fr: Localiser « %@ »
it: Trova "%@"
ja: 場所'%@'
nl: Vind '%@'
pt: Localizar '%@'

source: Log HID Events
ca: Registra els esdeveniments del dispositiu d'interfície humana
es: Registro de eventos del HID
fr: Journaliser les événements HID
it: Attiva log eventi HID
ja: HID イベントを記録
nl: Leg HID events vast
pt: Gravar Eventos de HID

source: Log Keyboard Events
ca: Registra els esdeveniments del teclat
es: Registro de eventos del teclado
fr: Journaliser les événements du clavier
it: Attiva log eventi tastiera
ja: Keyboard イベントを記録
nl: Leg toetsenbord events vast
pt: Gravar Eventos de Teclado

source: Low Controller Battery
ca: La càrrega de la bateria del controlador és baixa
fr: Piles de la manette déchargées
it: Batteria controller scarica
ja: コントローラのバッテリが少なくなっています
nl: Batterij van controller bijna leeg
pt: Bateria do Controle Fraca

source: MEDIA
pt: MÍDIA

source: Make sure your internet connection is active and download a suitable core.
ca: Assegureu-vos que la connexió a Internet està activada i baixeu un nucli adequat.
es: Asegúrese que su conexión a internet está activa y descargue un núcleo compatible.
fr: Assurez-vous que votre connexion internet est active et téléchargez un cœur adapté.
it: Assicurati di essere connesso a Internet e scarica un core adeguato.
ja: インターネットが接続され、コアがダウンロードされていることを確認して下さい。
nl: Zorg dat uw internetverbinding actief is en download een geschikte kern.
pt: Certifique que sua conexão de internet está ativa e baixe um núcleo apropriado.

source: Make your Wiimote discoverable
ca: Feu que el Wiimote sigui detectable
es: Haga visible su Wiimote
fr: Rendre votre Wiimote détectable
it: Rendi il Wiimote visibile
ja: Wiimoteを発見可能な状態にして下さい。
nl: Maak uw Wiimote detecteerbaar
pt: Tornar seu Wiimote visível

source: Manually choose system on import
ca: Selecciona el sistema manualment durant la importació
es: Elegir sistema manualmente al importar
fr: Choisir manuellement le système lors de l’importation
it: Scegli manualmente un sistema quando importi un gioco
ja: インポート時にシステムを自分で選択
nl: Kies manueel systeem bij importeren
pt: Escolher sistema manualmente ao importar

source: Missing Core
ca: Falta el nucli
es: Núcleo no encontrado
fr: Cœur manquant
it: Core mancante
ja: 見付からないコア
nl: Kern ontbreekt
pt: Núcleo Não Encontrado

source: Move selected games to Trash, or keep them in the Library folder?
ca: Voleu moure els jocs seleccionats a la paperera, o conservar-los a la carpeta de la biblioteca?
es: ¿Mover los juegos seleccionados a la papelera, o mantenerlos en la carpeta de la biblioteca?
fr: Placer les jeux dans la corbeille, ou les conserver dans le dossier de la bibliothèque ?
it: Vuoi spostare i giochi nel Cestino, o lasciarli nella cartella della Libreria?
ja: 選択したゲームをゴミ箱へ移動します。ライブラリフォルダに残しますか？
nl: De geselecteerde spellen naar de prullenmand verplaatsen of in de bibliotheekmap behouden?
pt: Mover jogos selecionados para a Lixeira ou mantê-los na pasta da Biblioteca?

source: Move to Trash
ca: Mou a la paperera
es: Mover a la papelera
fr: Dans la corbeille
it: Cestina
ja: ゴミ箱へ移動
nl: Verplaats naar prullenmand
pt: Mover para a Lixeira

source: Mute Audio
ca: Silencia el so
es: Silenciar audio
fr: Couper le son
it: Disattiva audio
ja: 消音にする
nl: Demp geluid
pt: Mutar Som

source: New Collection
ca: Nova col·lecció
es: Nueva colección
fr: Nouvelle collection
it: Nuova raccolta
ja: 新しいコレクション
nl: Nieuwe verzameling
pt: Nova Coleção

source: New Collection from Selection
ca: Nova col·lecció de la selecció
es: Nueva colección desde selección
fr: Nouvelle collection à partir de la sélection
it: Nuova raccolta da selezione
ja: セレクションから新しいコレクションを作成
nl: Nieuwe verzameling met selectie
pt: Nova Coleção a partir dos Selecionados

source: New Folder
ca: Nova carpeta
fr: Nouveau dossier
it: Nuova cartella
ja: 新しいフォルダ
nl: Nieuwe map
pt: Nova Pasta

source: New Smart Collection
ca: Nova col·lecció intel·ligent
fr: Nouvelle collection intelligente
it: Nuova raccolta smart
ja: 新しいスマートコレクション
nl: Nieuwe slimme verzameling
pt: Nova Coleção Inteligente

source: No
fr: Non
ja: いいえ
nl: Nee
pt: Não

source: No Save States available
ca: No hi ha cap partida desada disponible
fr: Aucune sauvegarde disponible
it: Nessun salvataggio emulazione disponibile
ja: 利用可能なセーブステートがありません
nl: Geen momentopnames beschikbaar
pt: Nenhum Salvamento disponível

source: No available controllers
ca: No hi ha cap controlador disponible
es: No hay mandos disponibles
fr: Aucune manette disponible
it: Nessun controller disponibile
ja: 利用可能なコントローラがありません
nl: Geen controllers beschikbaar
pt: Nenhum controle disponível

source: No game played yet!
ca: Encara no heu jugat a cap joc
fr: Aucun jeu lancé !
it: Non hai ancora giocato a nulla!
ja: まだ何のゲームもプレイされていません！
nl: Nog geen spel gespeeld!
pt: Nenhum jogo ainda foi jogado!

source: None
ca: Cap
es: Ninguna
fr: Aucune
it: Nessuna
ja: なし
nl: Geen
pt: Nenhum

source: Not implemented right now
ja: 今は実行しない
pt: Ainda não implementado

source: Only files in the OpenEmu Library folder will be moved to the Trash.
ca: Només es mouran a la paperera els fitxers de la carpeta de la biblioteca de l'OpenEmu.
es: Solo los archivos de la carpeta de la biblioteca de OpenEmu se moverán a la papelera.
fr: Seulement les fichiers du dossier de la bibliothèque OpenEmu seront placés sans la corbeille.
it: Solo i file che si trovano nella cartella della Libreria di OpenEmu verranno spostati nel Cestino.
ja: OpenEmuライブラリにあるファイルのみ、ゴミ箱に移動します。
nl: Enkel bestanden in de OpenEmu-bibliotheekmap zullen naar de prullenmand verplaatst worden.
pt: Somente arquivos na pasta da Biblioteca OpenEmu serão movidos para a Lixeira.

source: Open Collection
ca: Obre la col·lecció
es: Abrir colección
fr: Ouvrir la collection
it: Apri raccolta
ja: コレクションを開く
nl: Open verzameling
pt: Abrir Coleção

source: Open Library
ca: Obre la biblioteca
es: Abrir biblioteca
fr: Ouvrir la bibliothèque
it: Apri Libreria
ja: ライブラリを開く
nl: Open bibliotheek
pt: Abrir Biblioteca

source: OpenEmu could not find a Core to launch the game
ca: L'OpenEmu no ha trobat el nucli per executar el joc
es: OpenEmu no ha podido encontrar un núcleo para iniciar el juego
fr: OpenEmu n’a pas pu trouver de cœur pour lancer le jeu
it: OpenEmu non ha trovato nessun core per avviare il gioco
ja: このゲームを開くためのコアが見付かりませんでした。
pt: O OpenEmu não encontrou um Núcleo para iniciar o jogo

source: OpenEmu includes a save game feature that allows you to continue playing exactly where you left off.
ca: L'OpenEmu inclou una funcionalitat que us permet continuar la partida exactament on la vau deixar.
fr: OpenEmu inclut une fonctionnalité de sauvegarde qui vous permet de continuer votre partie exactement là où vous l’avez quitée.
it: OpenEmu include un sistema di salvataggio che permette di continuare il gioco esattamente da dove lo avevi interrotto.
ja: OpenEmuは、あなたがゲームを止めた段階でゲームをセーブする機能を備えています。
pt: O OpenEmu traz a possibilidade de Salvamentos permitindo que você continue jogando exatamente de onde parou.

source: OpenEmu needs a library to continue. You may choose an existing OpenEmu library or create a new one
ca: L'OpenEmu necessita una biblioteca per continuar. Podeu triar una biblioteca existent o crear-ne una de nova
es: OpenEmu necesita una biblioteca para continuar. Puede elegir una biblioteca existente de OpenEmu o crear una nueva
fr: OpenEmu nécessite une bibliothèque pour continuer. Vous devez choisir une bibliothèque OpenEmu existante ou en créer une nouvelle
it: A OpenEmu serve una Libreria per continuare. Puoi scegliere una Libreria di OpenEmu esistente o crearne una nuova
ja: OpenEmuを続けるためにはライブラリが必要です。既存のOpenEmuライブラリを選択するか、新規ライブラリを作成して下さい。
pt: O OpenEmu precisa de uma biblioteca para continuar. Você pode abrir bibliotecas OpenEmu existentes ou criar uma nova.

# OpenEmu uses 'Cores' to emulate games. You need the %@ Core to play %@
source: OpenEmu uses 'Cores' to emulate games. You need the %1$@ Core to play %2$@
ca: L'OpenEmu utilitza 'nuclis' per emular els jocs. Necessiteu el nucli %1$@ per jugar a %2$@
es: OpenEmu usa 'Núcleos' para emular juegos. Necesita el núcleo %1$@ para jugar a %2$@
fr: OpenEmu utilise des « cœurs » pour émuler les jeux. Vous avez besoin du cœur %@ pour jouer à %@
it: OpenEmu usa dei "core" per emulare i giochi. Per giocare a %2$@ occorre installare il core %1$@
ja: OpenEmuでゲームをエミュレートするには、'コア'が必要です。%2$@ をプレイするには %1$@ が必要です。
pt: OpenEmu utiliza 'Núcleos' para emular os jogos. Você precisa do Núcleo do %1$@ para jogar %2$@

source: OpenEmu will save and quit all games that are currently running.
ca: L'OpenEmu guardarà i tancarà tots els jocs que s'estan executant.
es: OpenEmu guardará y saldrá de todos los juegos que se están ejecutando actualmente.
fr: OpenEmu sauvegardera et quittera tous les jeux en cours d’exécution.
it: Tutti i giochi in esecuzione verranno salvati e poi interrotti.
ja: OpenEmuは、終了する時に現在のゲームを保存します。
pt: OpenEmu irá salvar e sair de todos os jogos que estiverem rodando.

source: Options
ca: Opcions
es: Opciones
it: Opzioni
ja: オプション
nl: Opties
pt: Opções

source: Pause Emulation
ca: Pausa l'emulació
fr: Mettre en pause l’émulation
it: Sospendi emulazione
ja: エミュレートを一時停止
nl: Emulatie pauzeren
pt: Pausar Emulação

source: Pause Gameplay
ca: Pausa la partida
fr: Mettre en pause le jeu
it: Sospendi il gioco
ja: ゲームを一時停止
nl: Spelen pauzeren
pt: Pausar Gameplay

source: Play Game
ca: Inicia el joc
es: Jugar partida
fr: Jouer
it: Avvia gioco
ja: ゲームをする
nl: Speel spel
pt: Jogar Jogo

source: Play Games (Caution)
ca: Inicia els jocs (Precaució)
es: Jugar partidas (Precaución)
fr: Jouer (attention)
it: Avvia giochi (attenzione)
ja: ゲームをする (警告)
nl: Speel spellen (Opgelet)
pt: Jogar Jogo (Cuidado)

source: Play Save Games
ca: Continua la partida desada
es: Jugar partidas guardadas
fr: Parties sauvegardées
it: Carica salvataggio
ja: セーブしたゲームをプレイする
nl: Speel opgeslagen spellen
pt: Jogar jogos salvos

source: Player %ld
ca: Jugador %ld
es: Jugador %ld
fr: Joueur %ld
it: Giocatore %ld
ja: プレーヤー %ld
nl: Speler %ld
pt: Jogador %ld

source: Please close all games and wait for the importer to finish.
ca: Tanqueu tots els jocs i espereu que l'importador acabi.
es: Por favor cierre todos los juegos y espere a que la importación finalice.
fr: Fermez tous les jeux et patientez jusqu’à la fin de l’importation.
it: Arresta tutti i giochi e attendi il completamento delle importazioni in corso.
ja: 全てのゲームを閉じ、インポートが終了するのをお待ち下さい。
pt: Por favor feche todos os jogos e aguarde a importação terminar.

source: Quick Load
ca: Carrega ràpidament
es: Carga rápida
fr: Chargement rapide
it: Caricamento rapido
ja: クイックロード
nl: Snel laden
pt: Carregamento Rápido

source: Quick Save
ca: Desa ràpidament
fr: Sauvegarde rapide
it: Salvataggio rapido
ja: クイックセーブ
nl: Snel opgeslagen spel
pt: Salvamento Rápido

source: Quick Save State
ca: Desa ràpidament
fr: Sauvegarde rapide
it: Salvataggio emulazione veloce
ja: クイックセーブステート
nl: Snelle momentopname
pt: Salvamento Rápido

source: Quick Save, Slot %@
ca: Desa ràpidament, espai %@
fr: Sauvegarde rapide, fente %@
it: Salvataggio emulazione veloce, slot %@
ja: スロット%@へクイックセーブ
nl: Snel opgeslagen spel, Slot %@
pt: Salvamento Rápido, Slot %@

source: Quit
ca: Surt
es: Salir
fr: Quitter
it: Esci
ja: 終了
nl: Stop
pt: Sair

source: Rating
ca: Valoració
es: Puntuación
fr: Note
it: Classifica
ja: レーティング
pt: Qualificar

source: Recently Added
ca: Afegits recentment
es: Recientemente añadidos
fr: Ajoutés récemment
it: Aggiunti di recente
ja: 最近追加されたもの
nl: Onlangs toegevoegd
pt: Adicionados Recentemente

source: Recovered Auto Save
ca: Partida desada automàticament recuperada
fr: Sauvegarde auto récupérée
it: Salvataggio automatico recuperato
ja: リカバリされたオートセーブ
pt: Salvamento Automático Recuperado

source: Region
ca: Regió
es: Región
fr: Région
it: Zona geografica
ja: 地域
nl: Regio
pt: Região

source: Remove
ca: Suprimeix
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
nl: Verwijder
pt: Remover

source: Remove duplicate states
pt: Remover estados duplicados

source: Remove missing states
pt: Remover estados não encontrados.

source: Rename
ca: Canvia el nom
es: Renombrar
fr: Renommer
it: Rinomina
ja: 名称を変更
nl: Hernoem
pt: Renomear

source: Rename "%@"
ca: Canvia el nom de "%@"
es: Renombrar "%@"
fr: Renommer « %@ »
it: Rinomina "%@"
ja: "%@"の名称を変更
nl: Hernoem "%@"
pt: Renomear "%@"

source: Rename Game
ca: Canvia el nom del joc
es: Renombrar juego
fr: Renommer le jeu
it: Rinomina il gioco
ja: ゲームの名称を変更
nl: Hernoem spel
pt: Renomear Jogo

source: Rename Special Save State or something?
ca: Reanomena la partida desada especial o alguna cosa?
fr: Renommer la sauvegarde spéciale ou quelque chose ?
it: Vuoi rinominare un salvataggio emulazione speciale?
ja: セーブステートの名称を変更しますか？
nl: Hernoem speciale momentopname of zo?
pt: Renomear Salvamento Especial ou algo do tipo?

source: Required files are missing.
ca: Falten arxius requerits.
es: Los archivos necesarios no se encontraron.
fr: Des fichiers requis sont manquants.
it: Mancano alcuni file necessari.
ja: 要求されたファイルが見付かりません。
nl: Benodigde bestanden ontbreken.
pt: Estão faltando arquivos necessários.

source: Resolve %ld Issues
ca: Resoleu %ld problemes
es: Solucionar %ld errores
fr: Résoudre %ld problèmes
it: Risolvi %ld problemi
ja: %ld の問題を解決する
nl: Verhelp %ld problemen
pt: Resolver %ld Conflitos

source: Resolve Issues
ca: Resol els problemes
es: Solucionar errores
fr: Résoudre les problèmes
it: Risolvi i problemi
ja: 問題を解決する
pt: Resolver Conflitos

source: Restart
ca: Reinicia
es: Reiniciar
fr: Redémarrer
it: Riavvia
ja: 再起動
nl: Herstart
pt: Reiniciar

source: Restart System
ca: Reinicia el sistema
es: Reiniciar sistema
fr: Redémarrer le système
it: Riavvia il sistema
ja: システムを再起動する
nl: Herstart systeem
pt: Reiniciar Sistema

source: Restart now",@""), OELocalizedString(@"Cancel",@"
pt: Reiniciar Agora",@""), OELocalizedString(@"Cancel",@"

source: Resume
ca: Continua
fr: Reprendre
it: Riprendi
ja: レジューム
nl: Hervat
pt: Continuar

source: Resume Emulation
ca: Continua l'emulació
fr: Reprendre l’émulation
it: Riprendi l'emulazione
ja: エミュレーションをレジューム
nl: Hervat emulatie
pt: Continuar Emulação

source: Run games using
ca: Executeu els jocs utilitzant
es: Ejecutar juegos usando
fr: Exécuter les jeux avec
it: Esegui giochi usando
ja: 以下を用いてゲームを起動
nl: Spellen starten met
pt: Rodar jogos usando

source: Save As:
ca: Anomena i desa:
es: Guardar como:
fr: Nom :
it: Nome:
ja: 別名で保存:
nl: Sla op als:
pt: Salvar como:

source: Save Current Game
es: Guardar partida actual
pt: Salvar Jogo Atual

source: Save Game
ca: Desa el joc
es: Guardar partida
fr: Sauvegarder partie
it: Salva il gioco
ja: ゲームを保存
nl: Sla spel op
pt: Salvamento

source: Save States
ca: Partides desades
fr: Sauvegarder parties
it: Salvataggi emulazione
ja: セーブステート
nl: Momentopnames
pt: Estados de Salvamento

source: Save to Slot %d
pt: Salvar no Espaço %d

source: Save-Game-%ld %@
es: Guardar-Partida-%ld %@
fr: Sauvegarde-%ld %@
it: Salvataggio-%ld %@
ja: セーブ-ゲーム-%ld %@
pt: Salvamento-%ld %@

source: Saved Games
ca: Jocs desats
es: Partidas guardadas
fr: Parties sauvegardées
it: Salvataggi
ja: 保存されたゲーム
nl: Opgeslagen spellen
pt: Jogos Salvos

source: Scanner Paused
ca: S'ha pausat l'escàner
es: Buscador pausado
fr: Analyse en pause
it: Scansione in pausa
ja: スキャナ停止中
nl: Scanner gepauzeerd
pt: Scanner Pausado

source: Scanning Directory
ca: S'està escanejant el directori
es: Analizando directorio
fr: Analyse du répertoire
it: Scansione cartella
ja: ディレクトリをスキャン中
nl: Bestandenlijst scannen
pt: Escaneando Diretório

source: Screenshots
ca: Captures de pantalla
es: Capturas de pantalla
fr: Captures d’écran
it: Istantanee
ja: スクリーンショット
nl: Schermafbeeldingen
pt: Capturas de Tela

source: Secrets
it: Segreti
ja: シークレット
nl: Geheimen
pt: Segredos

source: Select All
ca: Selecciona-ho tot
es: Marcar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: 全て選択
nl: Selecteer alles
pt: Selecionar Tudo

source: Select Audio Output Device
ca: Selecciona un dispositiu de sortida de so
es: Seleccionar dispositivo de entrada de audio
fr: Sélectionner le périphérique de sortie audio
it: Uscita audio
ja: オーディオ出力先を選択
nl: Selecteer audio-uitvoerapparaat
pt: Selecionar Dispositivo de Saída de Áudio

source: Select Cheat
ca: Selecciona un truc
es: Seleccionar truco
fr: Sélectionner le code de triche
it: Trucchi
ja: チートを選択
nl: Selecteer cheat
pt: Selecionar Trapaça

source: Select Core
ca: Selecciona el nucli
es: Seleccionar núcleo
fr: Sélectionner le cœur
it: Core
ja: コアを選択
nl: Selecteer kern
pt: Selecionar Núcleo

source: Select Filter
es: Seleccionar filtro
fr: Sélectionner le filtre
ja: フィルタを選択
pt: Selecionar Filtro

source: Select Scale
ca: Selecciona l'escala
es: Seleccionar escala
fr: Sélectionner l’échelle
it: Scala
ja: スケールを選択
nl: Selecteer schaal
pt: Selecionar Escala

source: Select first field after setting the last
ca: Seleccioneu el primer camp després de selecionar l'últim
es: Seleccionar primer campo después de configurar el último
fr: Sélectionner le premier champ après avoir configuré le dernier
it: Seleziona il primo campo dopo aver impostato l'ultimo
ja: 設定後に最初のフィールドを選択
nl: Selecteer eerste veld na het laatste ingesteld te hebben
pt: Selecione primeiro campo depois de setar o último

source: Set default save states directory
ca: Defineix el directori de les partides desades
fr: Répertoire des parties sauvegardées par défaut
it: Reimposta cartella dei salvataggi emulazione
ja: デフォルトのオートセーブステートディレクトリを設定
nl: Stel standaardmap voor momentopnames in
pt: Configurar pasta padrão dos estados de salvamento

source: Setup Assistant has finished
ca: L'assistent de configuració ha acabat
es: Asistente de configuración ha finalizado
fr: L’assistant d’installation a terminé
it: L'assistente iniziale è terminato
ja: セットアップ・アシスタントが完了しました。
nl: Set-upassistent is klaar
pt: O Assistente de Instalação terminou

source: Show In Finder
es: Mostrar en Finder
pt: Exibir no Finder

source: Show all global keys
ca: Mostra totes les tecles globals
fr: Afficher toutes les touches globales
it: Mostra tutti i controlli globali
ja: グローバルキーを全て表示する
nl: Toon alle globale toetsen
pt: Mostrar todas as chaves globais

source: Show audio output device in menu
ca: Mostra el dispositiu de sortida del so al menú
es: Mostrar dispositivo de entrada de audio en el menú
fr: Afficher le périphérique de sortie dans le menu
it: Mostra dispositivi di uscita audio nel menu
ja: オーディオ出力デバイスをメニューに表示
nl: Toon geluidsuitvoerapparaat in menu
pt: Exibir dispositivo de saída de áudio no menu

source: Show autosave in menu
ca: Mostra el desat automàtic al menú
fr: Afficher la sauvegarde automatique dans le menu
it: Mostra salvataggi automatici nel menu
ja: オートセーブをメニューに表示
pt: Exibir salvamento automático no menu

source: Show collection view debug controller
pt: Exibir collection view debug controller
