Repository: OpenEmu/OpenEmu
Catalog: OpenEmu/*.lproj/Localizable.strings
Languages: ca, es, fr, it, ja, nl, pt

source: Show game titles instead of rom names
ca: Mostra el nom dels jocs en comptes del nom dels fitxers ROM
es: Mostrar títulos de los juegos en lugar de nombres de las roms
fr: Afficher les titres des jeux à la place des noms des roms
it: Mostra titoli dei giochi al posto dei nomi delle ROM
ja: ROMの名前の代わりにゲームタイトルを表示する
nl: Toon titels van spellen in plaats van namen van ROM's
pt: Exibir Títulos dos jogos ao invés dos nomes das roms

source: Show options button
ca: Mostra el botó d'opcions
es: Mostrar botón opciones
fr: Afficher le bouton des options
it: Mostra il pulsante Opzioni
ja: オプションボタンを表示
nl: Toon optiesknop
pt: Exibir botão de opções

source: Show quicksave in menu
ca: Motra el desat ràpid al menú
fr: Afficher la sauvegarde rapide dans le menu
it: Mostra salvataggi veloci nel menu
ja: クイックセーブをメニューに表示
pt: Exibir salvamento rápido no menu

source: Slot %d
ca: Espai %d
es: Ranura %d
fr: Fente %d
ja: スロット %d
pt: Espaço %d

source: Slot %ld
ca: Espai %ld
es: Ranura %ld
fr: Fente %ld
ja: スロット %ld
pt: Espaço %ld

source: Slot 1
pt: Espaço 1

source: Some migrations failed to complete properly
ca: No s'ha completat correctament algunes migracions
fr: Quelques migrations ne se sont pas terminées correctement
it: Non è stato possibile completare correttamente alcune migrazioni
ja: マイグレーションが正常に完了しませんでした。
nl: Sommige migraties zijn niet correct afgerond
pt: Algumas migrações não foram concluídas com sucesso.

source: Start Scanning
ca: Escaneja
es: Comenzar búsqueda
fr: Démarrer l’analyse
it: Avvia scansione
ja: スキャンを開始
nl: Start scannen
pt: Iniciar Escaneamento

source: Stop
ca: Atura
es: Detener
fr: Arrêter
it: Arresta
ja: 停止
pt: Parar

source: Stop Emulation
ca: Atura l'emulació
es: Detener emulación
fr: Arrêter l’émulation
it: Arresta emulazione
ja: エミュレーションを停止
nl: Stop emulatie
pt: Parar Emulação

source: Switch To Flow View
es: Cambiar vista a Flow
pt: Mudar para Visão Cover Flow

source: Switch To Grid View
ca: Canvia a la visualització de graella
es: Cambiar vista a cuadrícula
fr: Présentation par grille
it: Visualizza come griglia
ja: グリッド表示にする
pt: Mudar para Visão em Tabela

source: Switch To List View
ca: Canvia a la visualització de llista
es: Cambiar vista a lista
fr: Présentation par liste
it: Visualizza come elenco
ja: リスト表示にする
pt: Mudar para Visão em Lista

source: System
ca: Sistema
fr: Système
it: Sistema
ja: システム
nl: Systeem
pt: Sistema

source: Take screenshots in native size
ca: Fes les captures de pantalla en la mida nativa
es: Hacer capturas de pantalla en tamaño original
fr: Faire des captures d’écran en conservant la taille d’origine
it: Scatta le istantanee nelle dimensioni originali
ja: スクリーンショットをネイティブサイズで表示
nl: Neem schermafbeeldingen in native grootte
pt: Fazer Capturas de Tela em tamanho nativo

source: Takes you to the %@ project website
ca: Us portarà al web del projecte %@
es: Le lleva a la página web del proyecto %@
fr: Atteindre le site web du projet %@
it: Vai al sito del progetto %@
ja: %@ プロジェクトのウェブサイトを表示
nl: Stuurt u naar de %@ project website
pt: Te leva para o site do projeto %@

source: The %1$@ core has compatibility issues and some games may contain glitches or not play at all. Please do not report problems as we are not responsible for the development of %2$@.
ca: El nucli %1$@ té problemes de compatibilitat i alguns jocs poden tenir defectes o no funcionar. No ens informeu dels problemes ja que no som responsables del desenvolupament del %2$@.
fr: Le cœur %@ a des problèmes de compatibilité et certains jeux peuvent poser problème ou ne pas fonctionner du tout. Veuillez ne pas nous signaler ces problèmes car nous ne sommes pas responsables du développement de %@.
it: Il core %1$@ ha problemi di compatibilità: alcuni giochi potrebbero non funzionare o avere problemi. Siccome non siamo responsabili dello sviluppo di %2$@, non segnalateci difetti riguardanti questo core.
ja: %1$@ コアは互換性の問題を抱えているため、グリッチが発生するか、全くプレイが出来ません。 %2$@の問題についての報告は必要ありません。
nl: De %1$@-kern heeft compatibiliteitsproblemen en sommige spellen kunnen storingen ondervinden of gewoon niet werken. Gelieve deze problemen niet te rapporteren omdat wij niet verantwoordelijk zijn voor de ontwikkeling van %2$@.
pt: O Núcleo %1$@ possui problemas de compatibilidade e podem apresentar falhas ou mesmo não abrir. Por favor não reporte problemas pois não somos os responsáveis pelo desenvolvimento do %2$@.

source: The OpenEmu Library could not be found.
ca: No s'ha pogut trobar la biblioteca de l'OpenEmu.
es: La biblioteca de OpenEmu no se ha podido encontrar.
fr: Impossible de trouver la bibliothèque OpenEmu.
it: La Libreria di OpenEmu non è stata trovata.
ja: OpenEmuライブラリが見付かりませんでした。
nl: De OpenEmu-bibliotheek kon niet gevonden worden.
pt: A Biblioteca OpenEmu não pôde ser encontrada.

source: The System plugin could not be found!
ca: No s'ha pogut trobar el connector del sistema.
es: ¡El plugin del sistema no se ha podido encontrar!
fr: Impossible de trouver le plugin du système !
it: Il plugin di questo sistema non è stato trovato!
ja: システムプラグインが見付かりませんでした。
nl: De systeemplug-in kon niet gevonden worden!
pt: O plugin do Systema não foi encontrado!

source: The background process connection couldn't be established
pt: A conexão com o processo não pôde ser estabelecido

source: The background process couldn't be launched
pt: O processo não pôde ser iniciado

source: The battery in device number %1$lu, %2$@, is low. Please charge or replace the battery.
ca: La càrrega de la bateria del dispositiu número %1$lu, %2$@, és baixa. Carregueu o substituïu la bateria.
fr: Les piles du périphérique numéro %lu, %@, sont déchargées. Rechargez ou remplacez les piles.
it: La batteria del dispositivo %1$lu (%2$@) si sta scaricando. Ricaricare o cambiare la batteria.
ja: デバイス番号 %1$lu、及び %2$@, のバッテリが弱くなっています。電池を交換して下さい。
nl: De batterij in apparaat met nummer %1$lu, %2$@, is bijna leeg. Gelieve deze op te laden of te vervangen.
pt: A bateria no dispositivo número %1$lu, %2$@, está fraca. Por favor recarregue ou troque a bateria.

source: The core could not be downloaded. Try installing it from the Cores preferences.
ca: No s'ha pogut baixar el nucli. Intenteu instal·lar-lo des de les preferències dels nuclis.
es: El núcleo no se ha podido descargar. Intente instalarlo desde las preferencias de los núcleos.
fr: Impossible de télécharger le cœur. Essayez de l’installer à partir des préférences des cœurs.
it: Non è stato possibile scaricare il core. Prova a installarlo dalle preferenze dei core.
ja: コアがダウンロード出来ませんでした。コア設定からダウンロードし直して下さい。
nl: De kern kon niet worden gedownload. Probeer ze te installeren vanaf de voorkeuren voor kernen.
pt: O núcleo não pôde ser encontrado. Tente instalá-lo através do painel Núcleos nas preferências.

source: The file you selected doesn't exist
ca: El fitxer seleccionat no existeix
fr: Le fichier sélectionné n’existe pas
it: Il file selezionato non esiste
ja: 選択されたファイルは存在しません。
nl: The bestand dat u selecteerde bestaat niet
pt: O arquivo que você selecionou não existe

source: The game '%@' could not be started because a rom file could not be found. Do you want to locate it?
ca: No s'ha pogut iniciar el joc '%@' perquè no s'ha trobat un fitxer ROM. El voleu localitzar?
es: El juego '%@' no se ha podido iniciar debido a que el archivo rom no se ha encontrado. ¿Desea buscarlo?
fr: Impossible de démarrer la partie « %@ » car un fichier rom n’a pas pu être trouvé. Voulez-vous rechercher son emplacement ?
it: Non è stato possibile avviare il gioco "%@" perché non ho trovato il file ROM. Vuoi cercarlo manualmente?
ja: ROMファイルが見付からなかったため、'%@'を開始することが出来ませんでした。ファイルを再度指定しますか？
nl: Het spel '%@' kon niet gestart worden omdat een ROM-bestand niet gevonden kon worden. Wilt u het lokaliseren?
pt: O jogo '%@' não foi importado pois a ROM não pode ser encontrada. Deseja tentar localizá-la?

source: The game '%@' was imported.
ca: S'ha importat el joc '%@'.
es: El juego '%@' fue importado.
fr: Le jeu « %@ » a été importé.
it: Hai importato "%@".
ja: '%@' がインポートされました。
nl: Het spel '%@' werd geïmporteerd.
pt: O jogo '%@' foi importado.

source: The root proxy object is nil.
pt: O root proxy object é nulo.

source: This System has no corresponding core installed.
ca: El sistema no té el nucli corresponent instal·lat.
es: Este sistema no tiene su correspondiente núcleo instalado.
fr: Ce système n’a pas de cœur correspondant installé.
it: Per questo sistema non è stato installato nessun core.
ja: 関連するコアが見付かりません。
nl: Voor dit systeem is geen overeenkomstige kern geïnstalleerd.
pt: Este sistema não tem nenhum núcleo correspondente instalado.

source: This save state was created with a different core. Do you want to switch to that core now?
ca: Aquesta partida desada es va crear utilitzant un nucli diferent. Voleu canviar a aquest altre nucli?
fr: Cette partie sauvegardée a été créée avec un cœur différent. Voulez-vous changer le cœur maintenant ?
it: Questo salvataggio emulazione è stato creato con un altro core. Vuoi passare a quel core ora?
ja: このセーブステートは、別のコアで作成されています。作成されたコアへ変更しますか？
nl: Deze momentopname werd met een andere kern gemaakt. Wilt u nu omschakelen naar deze kern?
pt: Este estado de salvamento foi criado com um núcleo diferente. Deseja mudar para aquele Núcleo agora?

source: Title:
ca: Títol:
es: Título:
fr: Titre :
it: Titolo:
ja: タイトル:
nl: Titel:
pt: Título:

# To launch the save state %@ you will need to install the '%@' Core
source: To launch the save state %1$@ you will need to install the '%2$@' Core
ca: Per continuar la partida desada %1$@ heu d'instal·lar el nucli '%2$@'
fr: Pour lancer la partie sauvegardée %@, vous devez installer le cœur « %@ »
it: Per caricare il salvataggio %1$@ serve installare il core "%2$@"
ja: %1$@ のセーブステートを起動するには、'%2$@' のコアが必要です。
nl: Om de momentopname %1$@ te starten zal u de kern '%2$@' moeten installeren
pt: Para abrir este estado de salvamento %1$@ você precisará instalar o Núcleo '%2$@'

source: Toggle Fullscreen
ca: Commuta el mode de pantalla completa
fr: Basculer le mode plein écran
it: Modalità a tutto schermo
ja: フルスクリーンモード
nl: Schakel schermvullende weergave in/uit
pt: Alterna para Tela Cheia

source: Toggle Sidebar
ja: サイドバーを表示
pt: Alterna Barra Lateral

source: Unmute Audio
ca: Activa el so
es: No silenciar audio
fr: Réactiver le son
it: Attiva audio
ja: 消音を解除
nl: Ontdemp geluid
pt: Desmutar Áudio

source: Update
ca: Actualitza
fr: Mettre à jour
it: Aggiorna
ja: アップデート
pt: Atualizar

source: Update OpenVGDB
ca: Actualitza l'OpenVGDB
es: Actualizar OpenVGDB
fr: Mettre à jour OpenVGDB
it: Aggiorna OpenVGDB
ja: OpenVGDBをアップデート
pt: Atualizar OpenVGDB

source: Use game name as window title
ca: Utilitza el nom del joc pel nom de la finestra
es: Usar nombre del juego como título de ventana
fr: Utiliser le nom des jeux pour le titre de la fenêtre
it: Usa il nome del gioco come titolo della finestra
ja: ウィンドウタイトルにゲーム名を表示
nl: Gebruik spelnaam als venstertitel
pt: Usar nome do jogo como título da janela

source: Use gamecore picker
es: Usar selector de núcleo de juego
pt: Usar gamecore picker

source: Use quicksave slots
ca: Utilitza els espais del desat ràpid
fr: Utiliser les fentes de sauvegarde rapide
it: Usa slot salvataggi veloci
ja: クイックセーブスロットを使用
pt: Usar espaços de salvamento rápido

source: Warning
ca: Avís
fr: Avertissement
it: Attenzione
ja: 警告
nl: Waarschuwing
pt: Atenção

source: WiiRemote support (requires relaunch)
ca: Suporta el WiiRemote (requereix reinici)
es: Compatible WiiRemote (requiere reiniciar)
fr: Support de la télécommande Wii (nécessite un redémarrage)
it: Supporto WiiRemote (richiede il riavvio di OpenEmu)
ja: WiiRemoteサポート(再起動が必要です)
nl: WiiRemote-ondersteuning (vereist herstart)
pt: Suporte ao WiiRemote (requer reinício)

source: Won't be able to recognize it as special save state…
ca: No es podrà reconèixer com una partida desada especial…
fr: Cette sauvegarde ne sera pas reconnue comme une sauvegarde spéciale…
it: Poi non sarà più possibile identificarlo come un salvataggio emulazione speciale…
ja: 特別なセーブステートを認識できません…
nl: Zal het niet kunnen herkennen als een speciale momentopname…
pt: Não foi possível reconhecer como um estado de salvamento especial

source: Would you like to continue your last game?
ca: Voleu continuar des de l'última partida?
es: ¿Desea continuar su última partida?
fr: Voulez-vous continuer votre dernière partie ?
it: Vuoi riprendere la tua ultima partita?
ja: 最後のゲームの続きをプレイしますか？
nl: Wilt u uw laatste spel voortzetten?
pt: Deseja continuar seu último jogo?

source: Would you like to save your game before you quit?
ca: Voleu desar la partida abans de sortir?
fr: Voulez-vous sauvegarder votre partie avant de quitter ?
it: Vuoi salvare il gioco prima di uscire?
ja: ゲーム終了前にセーブしますか？
nl: Wilt u uw spel opslaan voor u stopt?
pt: Deseja salvar seu jogo antes de sair?

source: Yes
ca: Sí
es: Si
fr: Oui
it: Sì
ja: はい
nl: Ja
pt: Sim

source: You can't move your library here!
ca: No es pot moure la biblioteca aquí.
es: ¡No puede mover su biblioteca aquí!
fr: Vous ne pouvez pas déplacer votre bibliothèque ici !
it: Non puoi spostare la Libreria qui!
ja: ここへはライブラリを移動出来ません。
nl: U kan uw bibliotheek niet hiernaar verplaatsen!
pt: Você não pode mover sua biblioteca aqui!

source: You need to restart the application to commit the change
ca: Heu de reiniciar l'aplicació per aplicar el canvi
fr: Vous devez redémarrer l’application pour valider la modification
it: Per applicare le modifiche è necessario riavviare l'applicazione
ja: 変更を適用するには、OpenEmuを再起動して下さい。
nl: U moet de toepassing herstarten om de aanpassing door te voeren
pt: Você precisa reiniciar a aplicação para que as alterações tenham efeito

source: Your game finished importing, do you want to play it now?
ca: S'ha finalitzat la importació, voleu jugar-hi ara?
es: Finalizada la importación del juego, ¿desea jugar ahora?
fr: L’importation de votre jeu est terminée, voulez-vous y jouer maintenant ?
it: Il gioco è stato importato; vuoi aprirlo subito?
ja: ゲームのインポートが完了しました。ゲームを起動しますか？
nl: Uw spel is geïmporteerd, wilt u het nu spelen?
pt: A importação do jogo terminou, deseja jogar agora?

source: Your library was moved sucessfully. OpenEmu must relaunch now!
es: Su biblioteca fue movida correctamente. ¡OpenEmu debe reiniciarse ahora!
pt: Sua biblioteca foi movida com sucesso. O OpenEmu deve ser reiniciado agora!

source: Gameplay
ca: Joc
fr: Jeu
ja: ゲームプレイ
nl: Spelen

source: OK
ca: D'acord
es: Aceptar
ja: はい

source: To run this core you need the following: %@Drag and drop the required file(s) onto the game library window and try again.
ca: Per executar aquest nucli necessiteu el següent: %@Arrossegueu i deixeu anar el(s) fitxer(s) requerit(s) sobre la finestra de la biblioteca dels jocs i torneu-ho a provar.
es: Para ejecutar este núcleo necesita lo siguiente: %@Arrastrar y soltar los archivo(s) necesario(s) a la ventana de la biblioteca de juegos y volver a intentar.
fr: Pour exécuter ce cœur, vous devez : %@Glisser et déposer le(s) fichier(s) requis dans la fenêtre de la bibliothèque de jeu et réessayer.
it: Per usare questo core servono i seguenti file: %@Trascina i file richiesti sulla finestra della libreria e riprova.
ja: このコアを起動するには、以下のコアが必要です: %@要求されたファイルをゲームライブラリのウィンドウへドラッグ&ドロップして下さい。

source: CONSOLES
es: CONSOLAS
