Repository: OpenEmu/OpenEmu
Catalog: OpenEmu/*.lproj/OEControls.strings
Languages: ca, de, es, it, ja, nl, pt, ru

source: Change…
ca: Canvia…
de: Ändern …
it: Cambia…
ja: 変更…
nl: Wijzig…
pt: Alterar…
ru: Изменить…

source: Reset
ca: Restableix
de: Zurücksetzen
it: Reimposta
ja: リセット
nl: Stel opnieuw in
pt: Reiniciar
ru: Сбросить

source: Organization Methods:
ca: Mètodes d'organització:
de: Organisation:
es: Métodos de organización:
it: Organizzazione:
ja: 整理順序:
nl: Organisatiemethodes:
pt: Modos de Organização:
ru: Способы организации:

source: Game Library Folder Location:
ca: Ubicació de la carpeta de la biblioteca dels jocs:
de: Speicherort des Spieleordners:
es: Ubicación de la biblioteca de juegos:
it: Posizione della cartella della Libreria:
ja: ゲームライブラリフォルダの場所:
nl: Locatie van spellenbibliotheekmap:
pt: Local da Biblioteca de Jogos
ru: Расположение папки библиотеки игр:

source: Copy files to Game Library folder when adding to library
ca: En afegir els jocs, copia els fitxers a la carpeta de la biblioteca
de: Beim Hinzufügen Dateien in den Spieleordner kopieren
es: Copiar en biblioteca de juegos los archivos añadidos a la biblioteca
it: Copia i file nella cartella della Libreria quando aggiungi un gioco
ja: ライブラリへ追加されたファイルをゲームライブラリフォルダへコピーする
nl: Kopiëer bestanden naar spellenbibliotheekmap bij toevoegen aan bibliotheek
pt: Copiar arquivos para a Biblioteca de Jogos ao adicionar
ru: Копировать файлы в библиотеку при добавлении

source: Automatically lookup game information & artwork
ca: Cerca informació i imatges dels jocs automàticament
de: Automatisch nach Informationen und Cover suchen
es: Buscar información y carátulas de juegos automáticamente
it: Cerca automaticamente dati e illustrazioni dei giochi
ja: ゲーム情報とカバー写真を自動的に検索する
nl: Zoek automatisch spelinformatie en omslagafbeeldingen op
pt: Pesquisar automaticamente por informações e capa
ru: Автоматически подгружать информацию и обложки

source: Available Libraries:
ca: Biblioteques disponibles:
de: Verfügbare Konsolen:
es: Bibliotecas disponibles:
it: Librerie disponibili:
ja: 利用可能なライブラリ:
nl: Beschikbare bibliotheken:
pt: Bibliotecas Disponíveis:
ru: Доступные библиотеки:

source: Reset all dialog warnings:
ca: Restableix tots els diàlegs d'avís:
de: Alle Warnhinweise zurücksetzen:
es: Restaurar todos los diálogos de advertencia:
it: Reimposta visibilità degli avvisi:
ja: 全てのダイアログ警告をリセットする:
nl: Stel alle dialoogvensterwaarschuwingen opnieuw in:
pt: Resetar todos os avisos:
ru: Сбросить все окна предупреждений:

source: Reset Warnings
ca: Restableix els avisos
de: Warnungen zurücksetzen
es: Restaurar advertencias
it: Reimposta avvisi
ja: 警告をリセット
nl: Stel waarschuwingen opnieuw in
pt: Reiniciar Avisos
ru: Сбросить предупреждения

source: Window Management:
ca: Gestió de les finestres:
de: Fenster:
es: Gestión de ventanas:
it: Gestione finestre:
ja: ウィンドウ管理:
nl: Vensterbeheer:
pt: Gerenciar Janelas:
ru: Управление окном:

source: Always use popout gameplay window
ca: Fes servir una finestra per el joc
de: Spiele in Popout-Fenster starten
es: Usar siempre ventana emergente de juego
it: Apri in una finestra separata
ja: 常にゲーム画面をポップアップする
nl: Gebruik altijd pop-out gameplay-venster
pt: Sempre abrir jogo em uma nova tela
ru: Использовать всплывающее окно для игр

source: Always launch games fullscreen
ca: Executa els jocs en pantalla completa
de: Spiele im Vollbildmodus starten
es: Iniciar siempre juegos a pantalla completa
it: Apri in modalità a tutto schermo
ja: 常にゲーム画面をフルスクリーンで起動する
nl: Start spellen altijd in schermvullende weergave
pt: Sempre abrir jogos em Tela Cheia
ru: Запускать игры в полноэкранном режиме

source: Always pause gameplay when in background
ca: Pausa la partida quan la finestra estigui en segon pla
de: Spiele im Hintergrund pausieren
es: Pausar siempre en segundo plano
it: Sospendi il gioco quando non è in primo piano
ja: ゲーム画面がバックグラウンドにある時は一時停止する
nl: Pauzeer altijd gameplay wanneer op de achtergrond
pt: Sempre pausar quando estiver em background
ru: Приостанавливать игры при переключении окна

source: Always snap popout gameplay window to integer scale
de: Skalierung des Popout-Fensters auf Integer beschränken
es: Ajustar siempre ventana emergente de juego a escala de enteros
it: Ridimensiona finestra separata solo a fattori di scala interi

source: Allow playing with controllers when in background
ca: No deshabilitis els controladors quan la finestra estigui en segon pla
de: Controllereingaben im Hintergrund erlauben
es: Permitir jugar con mandos en segundo plano
it: Gioca con un controller anche se non in primo piano
ja: ゲーム画面がバックグラウンドにあってもコントローラを有効にする

source: Always float popout gamplay window on top
de: Popout-Fenster im Vordergrund halten
it: Finestra di gioco separata sempre in primo piano

source: Input:
ca: Disp.:
de: Eingabe:
es: Entrada:
ja: 入力:
nl: Invoer:
ru: Ввод:

source: Resolve Issues:
ca: Corregeix les incidències d'importació:
de: Probleme beheben:
es: Corregir errores de importación:
it: Risolvi problemi di importazione:
ja: インポートの問題を解決する:
nl: Herstel problemen met import:
pt: Corrigir conflitos de importação:
ru: Исправить проблемы импорта:

source: Apply
ca: Aplica
de: Importieren
es: Aplicar
it: Applica
ja: 適用
nl: Pas toe
pt: Aplicar
ru: Применить

source: Import Into:
ca: Importa a:
de: Importiere in:
es: Importar en:
it: Importa in:
ja: インポート先:

source: Next
ca: Següent
de: Weiter
es: Siguiente
it: Avanti
ja: 次へ
nl: Volgende
pt: Avançar
ru: Далее

source: Back
ca: Enrere
de: Zurück
es: Atrás
it: Indietro
ja: 前へ
nl: Terug
pt: Voltar
ru: Назад

source: Welcome to OpenEmu!
ca: Benvingut a l'OpenEmu
de: Willkommen bei OpenEmu!
es: ¡Bienvenido a OpenEmu!
it: Benvenuto in OpenEmu!
ja: OpenEmuへようこそ！
nl: Welkom bij OpenEmu!
pt: Bem vindo ao OpenEmu!
ru: Добро пожаловать в OpenEmu!

source: An exciting world of video games is within your grasp. To help you get started, we’d like to ask you a few quick questions which will guide you through the following… • Ensure you are running the correct system plugins (cores).
ca: Un món de videojocs està al teu abast. Per ajudar-vos a començar, ens agradaria preguntar-vos algunes preguntes ràpides que us guiaran a través del següent… • Assegureu-vos que esteu fent servir els connectors dels sistemes correctes (nuclis).
de: Eine unglaubliche Reise in die Welt der Videospiele erwartet dich! Bevor es losgeht, musst du allerdings noch die Spielekonsolen auswählen, die du emulieren willst.
es: El emocionante mundo de los videojuegos está a su alcance. Para ayudarle a empezar, nos gustaría hacerle unas rápidas preguntas que le guiarán a continuación… • Asegúrese que está ejecutando los complementos de los sistemas adecuados (núcleos).
it: A portata di mano c'è un incredibile mondo di videogiochi. Per iniziare, basterà rispondere a delle semplici domande guidate: in questo modo potrai… • Assicurarti che stai usando i plugin di sistema giusti (core).
ja: ビデオゲームの興奮をもう一度。OpenEmuを始めるにあたって、いくつかの簡単な質問にお答えください。 • システムに合ったプラグイン(コア)をご利用ください。
nl: Een opwindende wereld van videospellen ligt binnen handbereik. Om u te helpen beginnen zouden we u graag enkele snelle vragen stellen die u door het volgende heen zullen leiden… • Verzekeren dat u de juiste systeemplug-ins (kernen) gebruikt.
pt: Um excitante mundo de jogos agora está ao seu alcance. Para a começar, gostaríamos de fazer algumas perguntas que irão guiá-lo para que você consiga… • Assegurar que você esteja rodando os plugins corretos (núcleos).
ru: Захватывающий мир видеоигр находится у вас под рукой. Чтобы помочь вам начать работу, мы хотели бы задать несколько быстрых вопросов касаемо… • Убедиться что у вас актуальные системные плагины (ядра).

source: Click on the ‘Next’ button to begin!
ca: Feu clic al botó 'Següent' per començar.
de: Klicke auf „Weiter“, um zu beginnen.
es: ¡Haga clic en el botón ‘Siguiente’ para comenzar!
it: Fai clic su "Avanti" per iniziare!
ja: 「次へ」ボタンを押して先に進みます。
nl: Klik op de knop ‘Volgende’ om te beginnen!
pt: Clique no botão "Avançar" para continuar!
ru: Нажмите на кнопку ‘Далее’ чтобы начать!

source: OpenEmu is modular, and thanks to the work of other great open source projects, it can emulate a wide variety of video game systems (‘cores’). A select few require you tick and confirm that you want to install and use them. Your favorite game systems and games may not run without these cores.
ca: L'OpenEmu és modular, i gràcies a la feina feta per altres projectes de codi obert pot emular una àmplia varietat de sistemes de videojocs (‘nuclis’). Alguns nuclis requereixen que marqueu i confirmeu la seva instal·lació. Potser els vostres sistemes i jocs preferits no funcionaran sense aquests nuclis.
de: OpenEmu ist modular aufgebaut, und dank der Arbeit anderer großartiger Open-Source-Projekte können mit Hilfe sogenannter „Kerne“ eine Vielzahl an Spielekonsolen emuliert werden. Wähle die entsprechenden Kerne für deine Konsolen aus, ohne sie kannst du deine Lieblingspiele nicht spielen.
es: OpenEmu es modular, y gracias al trabajo de otros grandes proyectos de código abierto, puede emular una amplia variedad de sistemas de videojuegos (‘núcleos’). Algunos requieren que los marque y confirme que desea instalarlos y usarlos. Sus juegos y sistemas de juego favoritos no pueden funcionar sin estos núcleos.
it: OpenEmu è modulare: grazie al lavoro di altri progetti open source, può emulare una grande varietà di console per videogiochi ("core"). Puoi installare alcuni core opzionali contrassegnandoli nella seguente lista. Le tue console e giochi preferiti potrebbero non funzionare senza questi core.
ja: OpenEmuオープンソースプロジェクトの貢献に寄与する全ての方々へ感謝します。OpenEmuは様々な種類のビデオゲームを起動することが出来ます。いくつかのシステムではコアを別途必要とする場合があります。
nl: OpenEmu is modulair, en dankzij het werk van andere grote open-source projecten kan het een brede waaier aan consoles (‘kernen’) emuleren. Een beperkt aantal van deze vragen dat u ze aanvinkt en bevestigt dat u ze wilt installeren en gebruiken. Uw favoriete consoles en spellen werken mogelijk niet zonder deze kernen.
pt: O OpenEmu é modular e graças ao trabalho de outros grandes projetos de código aberto, ele pode emular uma grande variedade de vídeo games (núcleos). Selecione abaixo e confirme aqueles que você deseja instalar e utilizar. Seus jogos e consoles favoritos não podem rodar sem estes núcleos.
ru: OpenEmu является модульным, и благодаря работе других крупных проектов с открытым исходным кодом, он может эмулировать широкий спектр игровых систем (ядер). Выберите некоторые из них галочками и подтвердите, что вы хотите установить и использовать их. Ваши любимые игровые системы и игры не могут работать без этих ядер.

source: System Cores Installation
ca: Instal·lació dels nuclis dels sistemes
de: Systemkern-Installation
es: Instalación de núcleos de sistemas
it: Installazione dei core di sistema
ja: システムコアをインストール
nl: Systeemkerninstallatie
pt: Instalação dos Núcleos
ru: Установка системных ядер

source: Let’s Go!
ca: Som-hi!
de: Los geht’s!
es: ¡Vamos!
it: Andiamo!
ja: 次へ
nl: Kom op!
pt: Vamos nessa!
ru: В добрый путь!

source: Great! You are all setup now and ready to get gaming! Remember you can change both your keyboard and gamepad controls for yourself and other players via the Preferences at any time.
ca: Genial! Ja està tot a punt per jugar. Recordeu que podeu canviar la configuració del teclat i dels controladors a les Preferències en qualsevol moment.
de: Prima, du kannst nun anfangen zu spielen! Denk daran, dass du die Tastenbelegung deiner Tastatur oder deines Controllers jederzeit in den Einstellungen individuell anpassen kannst.
es: ¡Excelente! ¡Ahora está todo configurado y listo para los juegos! Recuerde que puede modificar tanto su teclado y los controles de los mandos como los de otros jugadores a través de las preferencias en cualquier momento.
it: Fantastico! I preparativi sono completati e puoi iniziare a giocare! Ricorda che puoi cambiare in qualunque momento i controlli per tastiera e gamepad, sia per te che per gli altri giocatori, attraverso il pannello Preferenze.
ja: セットアップが完了しました！ キーボードやゲームパッドの設定は、環境設定からいつでも変更可能です。お好みに合わせてご変更ください。
nl: Goed zo! Alles is klaar voor u om te beginnen spelen! Onthoud dat u op elk moment via Voorkeuren de bediening via toetsenbord en gamepad kunt wijzigen voor uzelf en andere spelers.
pt: Boa! Você configurou tudo e está pronto pra mandar ver nos jogos! Lembre-se que você pode configurar seu teclado e seus controles (ou de outros jogadores) nas Preferências quando quiser.
ru: Отлично! Все настройки на данный момент завершены и готовы к началу игры! Помните, что вы можете изменить элементы управления клавиатуры и геймпада для себя и других игроков в любое время.

source: Click the ‘Go’ button to begin your adventure.
ca: Feu clic al botó 'Vés' per començar.
de: Klicke auf „Los“, um das Abenteuer zu beginnen.
es: Haga clic en el botón ‘Continuar’ para comenzar su aventura.
it: Fai clic su "Vai" per iniziare l'avventura.
ja: 「次へ」を押してゲームを始める
nl: Klik op de ‘Begin’ knop om uw avontuur te beginnen.
pt: Clique no botão 'Pronto!' e comece a sua aventura.
ru: Нажмите на кнопку ‘Поехали!’ чтобы отправиться в приключение!

source: Go
ca: Vés
de: Los
es: Continuar
it: Vai
ja: 次へ
nl: Begin
pt: Pronto!
ru: Поехали!

source: Downloading Data…
de: Daten herunterladen …
es: Descargando datos…
it: Download dati in corso…

source: Reset All
de: Alle zurücksetzen
es: Restablecer todo
it: Reimposta Tutte

source: Cancel and Quit
ca: Cancel·la i surt
de: Abbrechen und beenden
it: Annulla ed esci
ja: キャンセルして停止
nl: Annuleer en stop
pt: Cancelar e Sair
ru: Отменить и выйти

source: Shader:
es: Sombreado:
ja: シェーダー:
ru: Ше́йдер:
