Repository: OpenEmu/OpenEmu
Catalog: ScummVM/scummvm/po/*.po
Languages: cs_cz, pl_pl

source: Gamestate save failed (%s)! Please consult the README for basic information, and for instructions on how to obtain further assistance.
cs_cz: Ulo¾ení stavu hry selhalo (%s)! Prosím pøeètìte si dokumentaci pro základní informace a pokyny k získání dal¹í podpory.
pl_pl: Zapis stanu gry nie powiód³ siê (%s)! Aby uzyskaæ podstawowe informacje oraz dowiedzieæ jak szukaæ dalszej pomocy, sprawd¼ plik README.

source: ~C~ancel
cs_cz: ~Z~ru¹it
pl_pl: ~A~nuluj

source: ~K~eys
cs_cz: ~K~lávesy
pl_pl: ~K~lawisze

source: Could not initialize color format.
cs_cz: Nelze zavést barevný formát.
pl_pl: Nie uda³o siê zainicjalizowaæ formatu kolorów.

source: Could not switch to video mode: '
cs_cz: Nelze pøepnout na re¾im obrazu: '
pl_pl: Nie uda³o siê prze³±czyæ w tryb wideo: '

source: Could not apply aspect ratio setting.
cs_cz: Nelze pou¾ít nastavení pomìru stran.
pl_pl: Nie uda³o siê zastosowaæ ustawienia formatu obrazu.

source: Could not apply fullscreen setting.
cs_cz: Nelze pou¾ít nastavení celé obrazovky.
pl_pl: Nie uda³o siê zastosowaæ ustawienia pe³nego ekranu.

source: You appear to be playing this game directly from the CD. This is known to cause problems, and it is therefore recommended that you copy the data files to your hard disk instead. See the README file for details.
cs_cz: Vypadá to, ¾e tuto hru hrajete pøímo z CD. Je známo, ¾e toto zpùsobuje problémy a je tedy doporuèeno, a» místo toho zkopírujete datové soubory na Vá¹ pevný disk. Pro podrobnosti si pøeètìte README.
pl_pl: Wygl±da na to, ¿e uruchamiasz grê bezpo¶rednio z p³yty CD, co powoduje pewne znane problemów. St±d zalecane jest skopiowanie plików gry na twardy dysk. Dalsze informacje s± dostêpne w pliku README.

source: This game has audio tracks in its disk. These tracks need to be ripped from the disk using an appropriate CD audio extracting tool in order to listen to the game's music. See the README file for details.
cs_cz: Tato hra má na svém disku zvukové stopy. Tyto stopy musí být z disku zkopírovány pou¾itím vhodného nástroje pro extrakci zvuku z CD, abyste mohli poslouchat hudbu ve høe. Pro podrobnosti si pøeètìte README.
pl_pl: Gra zawiera na swojej p³ycie ¶cie¿ki audio. Aby s³yszeæ muzykê, nale¿y je skopiowaæ na dysk za pomoc± odpowiedniego rippera CD audio. Dalsze informacje s± dostêpne w pliku README.

source: Gamestate load failed (%s)! Please consult the README for basic information, and for instructions on how to obtain further assistance.
cs_cz: Naètení stavu hry selhalo (%s)! Prosím pøeètìte si dokumentaci pro základní informace a pokyny k získání dal¹í podpory.
pl_pl: Odczyt stanu gry nie powiód³ siê (%s)! Aby uzyskaæ podstawowe informacje oraz dowiedzieæ jak szukaæ dalszej pomocy, sprawd¼ plik README.

source: WARNING: The game you are about to start is not yet fully supported by ScummVM. As such, it is likely to be unstable, and any saves you make might not work in future versions of ScummVM.
cs_cz: VAROVÁNÍ: Hra, kterou se chystáte spustit, není je¹tì plnì podporována ScummVM. Proto je mo¾né, ¾e bude nestabilní a jakékoli ulo¾ené hry nemusí fungovat v budoucích verzích ScummVM.
pl_pl: UWAGA: Gra, któr± chcesz w³±czyæ, nie jest jeszcze w pe³ni obs³ugiwana przez ScummVM. W zwi±zku z tym mo¿e byæ ona niestabilna, a wszelkie zapisy, których dokonasz, mog± byæ nieobs³ugiwane w przysz³ych wersjach ScummVM.

source: Start anyway
cs_cz: Pøesto spustit
pl_pl: W³±cz mimo tego

source: Use original save/load screens
cs_cz: Pou¾ít pùvodní obrazovky naètení/ulo¾ení
pl_pl: U¿yj oryginalnych ekranów odczytu/zapisu

source: Use the original save/load screens, instead of the ScummVM ones
cs_cz: Pou¾ít pùvodní obrazovky naètení/ulo¾ení místo ze ScummVM
pl_pl: U¿yj oryginalnych ekranów odczytu/zapisu zamiast tych ze ScummVM

source: Restore game:
cs_cz: Obnovit hru
pl_pl: Wznów grê:

source: Restore
cs_cz: Obnovit
pl_pl: Wznów

source: Use bright palette mode
cs_cz: Pou¾ít re¾im jasné palety
pl_pl: U¿yj trybu jasnej palety

source: Display graphics using the game's bright palette
cs_cz: Zobrazit grafiku pomocí jasné palety hry
pl_pl: Wy¶wietlaj grafikê za pomoc± jasnej palety gry

source: EGA undithering
cs_cz: Nerozkládání EGA
pl_pl: Anty-dithering EGA

source: Enable undithering in EGA games
cs_cz: Povolit nerozkládání v EGA hrách
pl_pl: W³±cz anty-dithering we wspieranych grach EGA

source: Prefer digital sound effects
cs_cz: Upøednostòovat digitální zvukové efekty
pl_pl: Preferuj cyfrowe efekty d¼wiêkowe

source: Prefer digital sound effects instead of synthesized ones
cs_cz: Upøednostòovat digitální zvukové efekty pøed syntetizovanými
pl_pl: Preferuj cyfrowe efekty d¼wiêkowe zamiast syntezowanych

source: Use IMF/Yamaha FB-01 for MIDI output
cs_cz: Pou¾ít IMF/Yamaha FB-01 pro výstup MIDI
pl_pl: U¿yj IMF/Yamaha FB-01 dla wyj¶cia MIDI

source: Use an IBM Music Feature card or a Yamaha FB-01 FM synth module for MIDI output
cs_cz: Pou¾ít kartu IBM Music Feature nebo modul syntetizátoru Yamaha FB-01 FM pro výstup MIDI
pl_pl: U¿yj karty IBM Music Feature lub modu³u syntezy FM Yamaha FB-01 dla wyj¶cia MIDI

source: Use CD audio
cs_cz: Pou¾ít zvuky na CD
pl_pl: U¿yj CD audio

source: Use CD audio instead of in-game audio, if available
cs_cz: Pou¾ít zvuky na CD místo ve høe, pokud je dostupné
pl_pl: U¿yj CD audio zamiast muzyki w grze, je¶li jest dostêpne

source: Use Windows cursors
cs_cz: Pou¾ít kurzory Windows
pl_pl: U¿yj windowsowych kursorów

source: Use the Windows cursors (smaller and monochrome) instead of the DOS ones
cs_cz: Pou¾ít kurzory Windows (men¹í a èernobílé) místo kurzorù z DOS
pl_pl: U¿yj windowsowych kursorów (mniejsze i monochromatyczne) zamiast DOS-owych

source: Use silver cursors
cs_cz: Pou¾ít støíbrné kurzory
pl_pl: U¿yj srebrnych kursorów

source: Use the alternate set of silver cursors, instead of the normal golden ones
cs_cz: Pou¾ít alternativní sadu støíbrných kurzorù místo standardních zlatých
pl_pl: U¿yj alternatywnego zestawu srebrnych kursorów zamiast zwyk³ych z³otych

source: Insert Disk %c and Press Button to Continue.
cs_cz: Vlo¾te Disk %c a Stisknìte Tlaèítko Pro Pokraèování.
pl_pl: W³ó¿ dysk %c i naci¶nij przycisk, aby kontynuowaæ.

source: Unable to Find %s, (%c%d) Press Button.
cs_cz: Nelze Najít %s, (%c%d) Stisknìte Tlaèítko.
pl_pl: Nie znaleziono %s, (%c%d). Naci¶nij przycisk.

source: Error reading disk %c, (%c%d) Press Button.
cs_cz: Chyba pøi ètení disku %c, (%c%d) Stisknìte Tlaèítko.
pl_pl: B³±d podczas odczytu dysku %c, (%c%d). Naci¶nij przycisk.

source: Game Paused. Press SPACE to Continue.
cs_cz: Hra Pozastavena. Stisknìte MEZERNÍK pro pokraèování.
pl_pl: Gra wstrzymana. Naci¶nij spacjê, aby wznowiæ.

source: Are you sure you want to restart? (Y/N)
cs_cz: Jste si jisti, ¾e chcete restartovat? (A/N)A
pl_pl: Na pewno chcesz zrestartowaæ grê? (T/N)T

source: Are you sure you want to quit? (Y/N)
cs_cz: Jste si jisti, ¾e chcete odejít? (A/N)A
pl_pl: Na pewno chcesz wyj¶æ? (T/N)T

source: Play
cs_cz: Hrát
pl_pl: Uruchom

source: Quit
cs_cz: Ukonèit
pl_pl: Zakoñcz

source: Insert save/load game disk
cs_cz: Vlo¾te herní disk pro ulo¾ení/naètení
pl_pl: W³ó¿ dysk zapisu

source: You must enter a name
cs_cz: Musíte zadat jméno
pl_pl: Musisz podaæ nazwê

source: The game was NOT saved (disk full?)
cs_cz: Hra NEBYLA ulo¾ena (plný disk?)
pl_pl: NIE zapisano stanu gry (brak miejsca?)

source: The game was NOT loaded
cs_cz: Hra NEBYLA naètena
pl_pl: NIE wczytano gry

source: Saving '%s'
cs_cz: Ukládám '%s'
pl_pl: Zapisywanie '%s'

source: Loading '%s'
cs_cz: Naèítám '%s'
pl_pl: Wczytywanie '%s'

source: Name your SAVE game
cs_cz: Pojmenujte svoji ULO®ENOU hru
pl_pl: Podaj nazwê zapisu

source: Select a game to LOAD
cs_cz: Vyberte hru k NAÈTENÍ
pl_pl: Wybierz zapis do wczytania

source: Game title)
cs_cz: Název hry
pl_pl: Tytu³ gry)

source: ~P~revious
cs_cz: ~P~øedchozí
pl_pl: ~P~oprzednia

source: ~N~ext
cs_cz: ~D~al¹í
pl_pl: ~N~astêpna

source: ~C~lose
cs_cz: ~Z~avøít
pl_pl: ~Z~amknij

source: Speech Only
cs_cz: Pouze Øeè
pl_pl: Tylko mowa

source: Speech and Subtitles
cs_cz: Øeè a Titulky
pl_pl: Mowa i napisy

source: Subtitles Only
cs_cz: Pouze Titulky
pl_pl: Tylko napisy

# lowres
source: Speech & Subs
cs_cz: Øeè a Titulky
pl_pl: Mowa i napisy

source: Select a Proficiency Level.
cs_cz: Vyberte úroveò odbornosti.
pl_pl: Wybierz poziom umiejêtno¶ci.

source: Refer to your Loom(TM) manual for help.
cs_cz: Pro nápovìdu si pøeètìte manuál Loom(TM).
pl_pl: Pomocy szukaj w instrukcji do³±czonej do Loom(TM).

source: Standard
cs_cz: Standardní
pl_pl: Standardowy

source: Practice
cs_cz: Cvièení
pl_pl: Trening

source: Expert
cs_cz: Pokroèilý
pl_pl: Ekspert

source: Common keyboard commands:
cs_cz: Bì¾né klávesové pøíkazy
pl_pl: Skróty klawiaturowe:

source: Save / Load dialog
cs_cz: Dialog Nahrát / Ulo¾it
pl_pl: Okno Zapisz / Wczytaj

source: Skip line of text
cs_cz: Pøeskoèit øádek textu
pl_pl: Pomiñ linijkê tekstu

source: Esc
cs_cz: Mezerník

source: Skip cutscene
cs_cz: Pøeskoèit video
pl_pl: Pomiñ scenkê

source: Space
cs_cz: Mezerník
pl_pl: Spacja

source: Pause game
cs_cz: Pozastavit hru
pl_pl: Wstrzymaj grê

source: Load game state 1-10
cs_cz: Nahrát stav hry 1-10
pl_pl: Wczytaj stan gry 1-10

source: Save game state 1-10
cs_cz: Ulo¾it stav hry 1-10
pl_pl: Zapisz stan gry 1-10

source: Toggle fullscreen
cs_cz: Zapnout celou obrazovku
pl_pl: W³±cz/wy³±cz pe³ny ekran

source: Music volume up / down
cs_cz: Hlasitost hudby nahoru / dolù
pl_pl: Zwiêksz/zmniejsz g³o¶no¶æ muzyki

source: Text speed slower / faster
cs_cz: Zvý¹it / Sní¾it rychlost textu
pl_pl: Zwiêksz/zmniejsz prêdko¶æ tekstu

source: Simulate left mouse button
cs_cz: Napodobit levé tlaèítko my¹i
pl_pl: Symuluje lewy przycisk myszy

source: Simulate right mouse button
cs_cz: Napodobit pravé tlaèítko my¹i
pl_pl: Symuluje prawy przycisk myszy

source: Special keyboard commands:
cs_cz: Speciální klávesové pøíkazy
pl_pl: Specjalne skróty klawiaturowe:

source: Show / Hide console
cs_cz: Ukázat / Skrýt konzoli
pl_pl: Schowaj / poka¿ konsolê

source: Start the debugger
cs_cz: Spustit ladící program
pl_pl: W³±cz debugger

source: Show memory consumption
cs_cz: Zobrazit spotøebu pamìti
pl_pl: Poka¿ zu¿ycie pamiêci

source: Run in fast mode (*)
cs_cz: Spustit v rychlém re¾imu (*)
pl_pl: W³±cz w trybie szybkim (*)

source: Run in really fast mode (*)
cs_cz: Spustit ve velmi rychlém re¾imu (*)
pl_pl: W³±cz w trybie bardzo szybkim (*)

source: Toggle mouse capture
cs_cz: Povolit zachycování my¹i
pl_pl: W³±cz/wy³±cz przechwytywanie myszy

source: Switch between graphics filters
cs_cz: Pøepínat mezi grafickými filtry
pl_pl: Prze³±czaj pomiêdzy filtrami grafiki

source: Increase / Decrease scale factor
cs_cz: Zvìt¹it / Zmen¹it faktor zmìny velikosti
pl_pl: Zwiêksz / zmniejsz wspó³czynnik skalowania

source: Toggle aspect-ratio correction
cs_cz: Povolit korekci pomìru stran
pl_pl: W³±cz/wy³±cz korekcjê formatu obrazu

source: * Note that using ctrl-f and
cs_cz: Upozoròujeme, ¾e pou¾ívání ctrl-f a
pl_pl: * Miej na uwadze, ¿e u¿ywanie ctrl-f

source: ctrl-g are not recommended
cs_cz: ctrl-g není doporuèeno
pl_pl: i ctrl-g nie jest wskazane

source: since they may cause crashes
cs_cz: jeliko¾ mù¾ou zpùsobit pád
pl_pl: poniewa¿ mog± one spowodowaæ zawieszenie siê,

source: or incorrect game behavior.
cs_cz: nebo nesprávné chování hry.
pl_pl: b±d¼ nieodpowiednie zachowanie gry.

source: Spinning drafts on the keyboard:
cs_cz: Pletení náèrtkù na klávesnici:
pl_pl: Tkanie splotów na klawiaturze:

source: Main game controls:
cs_cz: Hlavní ovládací prvky:
pl_pl: G³ówne sterowanie gry:

source: Push
cs_cz: Tlaèit
pl_pl: Pchnij

source: Pull
cs_cz: Táhnout
pl_pl: Poci±gnij

source: Give
cs_cz: Dát
pl_pl: Daj

source: Open
cs_cz: Otevøít
pl_pl: Otwórz

source: Go to
cs_cz: Jít do
pl_pl: Id¼ do

source: Get
cs_cz: Vzít
pl_pl: We¼

source: Use
cs_cz: Pou¾ít
pl_pl: U¿yj

source: Read
cs_cz: Pøeèíst
pl_pl: Czytaj

source: New kid
cs_cz: Nové dítì
pl_pl: Nowy dzieciak

source: Turn on
cs_cz: Zapnout
pl_pl: W³±cz

source: Turn off
cs_cz: Vypnout
pl_pl: Wy³±cz

source: Walk to
cs_cz: Pøejít na
pl_pl: Podejd¼ do

source: Pick up
cs_cz: Sebrat
pl_pl: Podnie¶

source: What is
cs_cz: Co je
pl_pl: Czym jest

source: Unlock
cs_cz: Odemknout
pl_pl: Otwórz

source: Put on
cs_cz: Obléct
pl_pl: Za³ó¿

source: Take off
cs_cz: Svléct
pl_pl: Zdejmij

source: Fix
cs_cz: Spravit
pl_pl: Napraw

source: Switch
cs_cz: Pøepnout
pl_pl: Prze³±cz

source: Look
cs_cz: Dívat se
pl_pl: Spójrz

source: Talk
cs_cz: Mluvit
pl_pl: Rozmawiaj

source: Travel
cs_cz: Cestovat
pl_pl: Podró¿uj

source: To Henry / To Indy
cs_cz: Henrymu / Indymu
pl_pl: Do Henry'ego / Do Indy'ego

source: play C minor on distaff
cs_cz: zahrát c moll na pøeslici
pl_pl: zagraj c-moll na k±dzieli

source: play D on distaff
cs_cz: zahrát D na pøeslici
pl_pl: zagraj D na k±dzieli

source: play E on distaff
cs_cz: zahrát E na pøeslici
pl_pl: zagraj E na k±dzieli

source: play F on distaff
cs_cz: zahrát F na pøeslici
pl_pl: zagraj F na k±dzieli

source: play G on distaff
cs_cz: zahrát G na pøeslici
pl_pl: zagraj G na k±dzieli

source: play A on distaff
cs_cz: zahrát A na pøeslici
pl_pl: zagraj A na k±dzieli

source: play B on distaff
cs_cz: zahrát B na pøeslici
pl_pl: zagraj B na k±dzieli

source: play C major on distaff
cs_cz: zahrát C dur na pøeslici
pl_pl: zagraj C-dur na k±dzieli

source: puSh
cs_cz: tlaèIt
pl_pl: pchnij

source: pull (Yank)
cs_cz: táhnout (©kubnout)
pl_pl: poci±gnij

source: Talk to
cs_cz: Mluvit s
pl_pl: Rozmawiaj z

source: Look at
cs_cz: Dívat se na
pl_pl: Spójrz na

source: turn oN
cs_cz: zapnouT
pl_pl: w³±cz

source: turn oFf
cs_cz: vypnoUt
pl_pl: wy³±cz

source: KeyUp
cs_cz: KlávesaNahoru
pl_pl: Strza³ka do góry

source: Highlight prev dialogue
cs_cz: Zvýraznit pøedchozí dialog
pl_pl: Pod¶wietl poprzedni dialog

source: KeyDown
cs_cz: KlávesaDolù
pl_pl: Strza³ka w dó³

source: Highlight next dialogue
cs_cz: Zvýraznit následující dialog
pl_pl: Pod¶wietl nastêpny dialog

source: Walk
cs_cz: Jít
pl_pl: Id¼

source: Inventory
cs_cz: Inventáø
pl_pl: Ekwipunek

source: Object
cs_cz: Objekt
pl_pl: Przedmiot

source: Black and White / Color
cs_cz: Èernobílé / Barva
pl_pl: Czarno-bia³y / Kolorowy

source: Eyes
cs_cz: Oèi
pl_pl: Oczy

source: Tongue
cs_cz: Jazyk
pl_pl: Jêzyk

source: Punch
cs_cz: Udeøit
pl_pl: Piê¶æ

source: Kick
cs_cz: Kopnout
pl_pl: Kopniêcie

source: Examine
cs_cz: Prohlédnout
pl_pl: Zbadaj

source: Regular cursor
cs_cz: Obyèejný kurzor
pl_pl: Zwyk³y kursor

source: Comm
cs_cz: Komunikace
pl_pl: Kom.

source: Save / Load / Options
cs_cz: Ulo¾it / Nahrát / Volby
pl_pl: Zapis / Odczyt / Opcje

source: Other game controls:
cs_cz: Dal¹í ovládací prvky hry
pl_pl: Reszta sterowania gry:

source: Inventory:
cs_cz: Inventáø:
pl_pl: Ekwipunek:

source: Scroll list up
cs_cz: Posunout seznam nahoru
pl_pl: Przewiñ listê do góry

source: Scroll list down
cs_cz: Posunout seznam dolu
pl_pl: Przewiñ listê w dó³

source: Upper left item
cs_cz: Polo¾ka vlevo nahoøe
pl_pl: Przedmiot u góry, z lewej

source: Lower left item
cs_cz: Polo¾ka vlevo dole
pl_pl: Przedmiot na dole, z lewej

source: Upper right item
cs_cz: Polo¾ka vpravo nahoøe
pl_pl: Przedmiot u góry, z prawej

source: Lower right item
cs_cz: Polo¾ka vpravo dole
pl_pl: Przedmiot na dole, z prawej

source: Middle left item
cs_cz: Polo¾ka vlevo uprostøed
pl_pl: Przedmiot na ¶rodku, z lewej

source: Middle right item
cs_cz: Polo¾ka vpravo uprostøed
pl_pl: Przedmiot na ¶rodku, z prawej

source: Switching characters:
cs_cz: Mìnìní postav:
pl_pl: Zmiana postaci:

source: Second kid
cs_cz: Druhé dítì
pl_pl: Drugi dzieciak

source: Third kid
cs_cz: Tøetí dítì
pl_pl: Trzeci dzieciak

source: Fighting controls (numpad):
cs_cz: Ovládání boje (num. kláv.)
pl_pl: Sterowanie podczas walki (klaw. num.):

source: Step back
cs_cz: Ustoupit
pl_pl: Odsuñ siê

source: Block high
cs_cz: Bránit nahoøe
pl_pl: Wysoki blok

source: Block middle
cs_cz: Bránit uprostøed
pl_pl: ¦rodkowy blok

source: Block low
cs_cz: Bránit dole
pl_pl: Dolny blok

source: Punch high
cs_cz: Udeøit nahoru
pl_pl: Wysokie uderzenie

source: Punch middle
cs_cz: Udeøit doprostøed
pl_pl: ¦rodkowe uderzenie

source: Punch low
cs_cz: Udeøit dolù
pl_pl: Niskie uderzenie

source: These are for Indy on left.
cs_cz: Tyto jsou pro Indyho nalevo.
pl_pl: Te s± dla Indy'ego po lewej.

source: When Indy is on the right,
cs_cz: Kdy¾ je Indy napravo,
pl_pl: Kiedy Indy jest po prawej,

source: 7, 4, and 1 are switched with
cs_cz: 71 4 a 1 jsou zamìnìny s
pl_pl: 7, 4, i 1 zostaj± zamienione

source: 9, 6, and 3, respectively.
cs_cz: 9, 6 a 3, v tomto poøadí.
pl_pl: na 9, 6 i 3.

source: Biplane controls (numpad):
cs_cz: Kontrola dvojplo¹níku (numerická klávesnice)
pl_pl: Sterowanie dwup³atowcem (klaw. num.):

source: Fly to upper left
cs_cz: Letìt doprava nahoru
pl_pl: Leæ do góry, w lewo

source: Fly to left
cs_cz: Letìt doleva
pl_pl: Leæ w lewo

source: Fly to lower left
cs_cz: Letìt doleva dolù
pl_pl: Leæ na dó³, w lewo

source: Fly upwards
cs_cz: Letìt nahoru
pl_pl: Leæ do góry

source: Fly straight
cs_cz: Letìt rovnì
pl_pl: Leæ prosto

source: Fly down
cs_cz: Letìt dolù
pl_pl: Leæ w dó³

source: Fly to upper right
cs_cz: Letìt doprava nahoru
pl_pl: Leæ do góry, w prawo

source: Fly to right
cs_cz: Letìt doprava
pl_pl: Leæ w prawo

source: Fly to lower right
cs_cz: Letìt doprava dolù
pl_pl: Leæ w dó³, w prawo

source: Native MIDI support requires the Roland Upgrade from LucasArts, but %s is missing. Using AdLib instead.
cs_cz: Pøirozená podpora MIDI vy¾aduje Aktualizaci Roland od LucasArts, ale %s chybí. Místo toho je pou¾it AdLib.
pl_pl: Natywne wsparcie MIDI wymaga aktualizacji Rolanda od LucasArts, ale brakuje %s. Prze³±czam na tryb AdLib.

source: Failed to save game state to file: %s
cs_cz: Ulo¾ení stavu hry selhalo do souboru: %s
pl_pl: Nie uda³o siê zapisaæ stanu gry do pliku: %s

source: Failed to load game state from file: %s
cs_cz: Nahrání stavu hry selhalo ze souboru: %s
pl_pl: Nie uda³o siê wczytaæ stanu gry z pliku: %s

source: Successfully saved game state in file: %s
cs_cz: Stav hry úspì¹nì ulo¾en do: %s
pl_pl: Pomy¶lnie zapisano stan w pliku: %s

source: Usually, Maniac Mansion would start now. But ScummVM doesn't do that yet. To play it, go to 'Add Game' in the ScummVM start menu and select the 'Maniac' directory inside the Tentacle game directory.
cs_cz: Normálnì by teï Maniac Mansion byl spu¹tìn. Ale ScummVM toto zatím nedìlá. Abyste toto mohli hrát, pøejdìte do 'Pøidat Hru' v poèáteèním menu ScummVM a vyberte adresáø 'Maniac' uvnitø herního adresáøe Tentacle.
pl_pl: Zwykle w tym momencie uruchomi³oby siê Maniac Mansion, ale ScummVM jeszcze tego nie obs³uguje. Aby zagraæ, u¿yj "Dodaj grê..." z menu startowego ScummVM i wybierz podkatalog "Maniac" z katalogu gry Tentacle.

source: ~Z~ip Mode Activated
cs_cz: ~R~e¾im Svi¹tìní Aktivován
pl_pl: ~T~ryb turbo aktywny

source: ~T~ransitions Enabled
cs_cz: ~P~øechody zapnuty
pl_pl: ~P~rzej¶cia w³±czone

source: ~D~rop Page
cs_cz: ~Z~ahodit Stránku
pl_pl: ~O~pu¶æ stronê

source: ~S~how Map
cs_cz: ~Z~obrazit Mapu
pl_pl: ~P~oka¿ mapê

source: ~M~ain Menu
cs_cz: ~H~lavní Menu
pl_pl: ~M~enu g³ówne

source: ~W~ater Effect Enabled
cs_cz: ~E~fekt Vody Zapnut
pl_pl: ~E~fekty wody w³±czone

source: Cutscene file '%s' not found!
cs_cz: Soubor videa '%s' nenalezen'
pl_pl: Nie znaleziono pliku przerywnika '%s'!

source: Failed to load game state from file.
cs_cz: Nelze naèíst stav hry ze souboru.
pl_pl: Nie uda³o siê wczytaæ stanu gry z pliku.

source: Failed to save game state to file.
cs_cz: Nelze ulo¾it stav hry do souboru.
pl_pl: Nie uda³o siê zapisaæ stanu gry do pliku.

source: Failed to delete file.
cs_cz: Nelze smazat soubor.
pl_pl: Nie uda³o siê usun±æ pliku.

source: Failed to save game
cs_cz: Nelze ulo¾it hru.
pl_pl: Nie uda³o siê zapisaæ stanu gry

source: Studio audience
cs_cz: Publikum ve studiu
pl_pl: Publiczno¶æ studyjna

source: Enable studio audience
cs_cz: Povolit publikum ve studiu
pl_pl: W³±cz publiczno¶æ studyjn±

source: Skip support
cs_cz: Podpora pøeskoèení
pl_pl: Obs³uga pomijania

source: Allow text and cutscenes to be skipped
cs_cz: Umo¾nit, aby text a videa mohly být pøeskoèeny
pl_pl: Pozwól pomijaæ tekst i przerywniki

source: Helium mode
cs_cz: Héliový re¾im
pl_pl: Tryb helowy

source: Enable helium mode
cs_cz: Zapnout héliový re¾im
pl_pl: W³±cz tryb helowy

source: Smooth scrolling
cs_cz: Plynulé posunování
pl_pl: P³ynne przewijanie

source: Enable smooth scrolling when walking
cs_cz: Povolit plynulé posunování pøi chùzi
pl_pl: W³±cz p³ynne przewijanie przy chodzeniu

source: Floating cursors
cs_cz: Plovoucí kurzory
pl_pl: P³ywaj±ce kursory

source: Enable floating cursors
cs_cz: Povolit plovoucí kurzory
pl_pl: W³±cz p³ywaj±ce kursory

source: HP bar graphs
cs_cz: Sloupcový indikátor zdraví
pl_pl: Histogramy HP

source: Enable hit point bar graphs
cs_cz: Povolit sloupcový indikátor zdraví
pl_pl: W³±cz histogramy punktów ¿ycia

source: Attack 1
cs_cz: Útok 1
pl_pl: Atak 1

source: Attack 2
cs_cz: Útok 2
pl_pl: Atak 2

source: Attack 3
cs_cz: Útok 3
pl_pl: Atak 3

source: Move Forward
cs_cz: Vpøed
pl_pl: Ruch naprzód

source: Move Back
cs_cz: Vzad
pl_pl: Ruch wstecz

source: Slide Left
cs_cz: Pøesunout se Doleva
pl_pl: ¦lizg w lewo

source: Slide Right
cs_cz: Pøesunout se Doprava
pl_pl: ¦lizg w prawo

source: Turn Left
cs_cz: Otoèit se doleva
pl_pl: Obrót w lewo

source: Turn Right
cs_cz: Otoèit se doprava
pl_pl: Obrót w prawo

source: Rest
cs_cz: Odpoèinout si
pl_pl: Odpoczynek

source: Options
cs_cz: Volby
pl_pl: Opcje

source: Choose Spell
cs_cz: Zvolit Kouzlo
pl_pl: Wybierz zaklêcie

source: You appear to be using a General MIDI device, but your game only supports Roland MT32 MIDI. We try to map the Roland MT32 instruments to General MIDI ones. It is still possible that some tracks sound incorrect.
cs_cz: Zdá se, ¾e pou¾íváte zaøízení General MIDI, ale va¹e hra podporuje pouze Roland MT32 MIDI. Sna¾íme se mapovat nástroje Roland MT32 na ty od General MIDI. Je stále mo¾né, ¾e nìkteré stopy nebudou znít správnì.
pl_pl: Wygl±da na to, ¿e u¿ywasz urz±dzenia General MIDI, ale gra obs³uguje tylko MIDI Roland MT32. Próbujemy przypisaæ instrumenty Rolanda MT32 do instrumentów General MIDI. Niektóre utwory mog± byæ ¼le odtwarzane.

source: Unable to find "sky.cpt" file! Please download it from www.scummvm.org
cs_cz: Nelze nalézt soubor "sky.cpt"! Stáhnìte si ho, prosím z www.scummvm.org
pl_pl: Nie znaleziono pliku "sky.cpt"! Pobierz go ze strony www.scummvm.org

source: The "sky.cpt" file has an incorrect size. Please (re)download it from www.scummvm.org
cs_cz: Soubor "sky.cpt" má nesprávnou velikost. Stáhnìte si ho, prosím, (znovu) z www.scummvm.org
pl_pl: Plik "sky.cpt" ma nieprawid³owy rozmiar. Pobierz go (ponownie) ze strony www.scummvm.org

source: Floppy intro
cs_cz: Úvod z diskety
pl_pl: Intro z wersji dyskietkowej

source: Use the floppy version's intro (CD version only)
cs_cz: Pou¾ít verzi úvodu z diskety (Pouze verze CD)
pl_pl: U¿yj intra z wersji dyskietkowej (tylko dla wersji CD)

source: PSX stream cutscene '%s' cannot be played in paletted mode
cs_cz: Proud videa PSX '%s' nemù¾e být pøehrán v re¾imu palety
pl_pl: Przerywnik w formacie strumieniowym PSX '%s' nie mo¿e zostaæ odtworzony w trybie indeksowanym

source: DXA cutscenes found but ScummVM has been built without zlib support
cs_cz: Videa DXA nalezena, ale ScummVM byl sestaven bez podpory zlib
pl_pl: Znaleziono przerywniki w formacie DXA, ale ScummVM jest skompilowany bez obs³ugi zlib

source: MPEG2 cutscenes are no longer supported
cs_cz: Videa MPGE2 ji¾ nejsou podporována
pl_pl: Przerywniki w formacie MPEG2 nie s± ju¿ obs³ugiwane

source: Cutscene '%s' not found
cs_cz: Video '%s' nenalezeno
pl_pl: Nie znaleziono przerywnika '%s'
