Repository: OpenEmu/OpenEmu
Catalog: ScummVM/scummvm/po/*.po
Languages: cs_cz, pl_pl

source: (built on %s)
cs_cz: (sestaveno %s)
pl_pl: (skompilowany %s)

source: Features compiled in:
cs_cz: Zakompilované funkce:
pl_pl: Wkompilowane funkcje:

source: Available engines:
cs_cz: Dostupná jádra:
pl_pl: Dostêpne silniki:

source: Go up
cs_cz: Jít nahoru
pl_pl: W górê

source: Go to previous directory level
cs_cz: Jít na pøedchozí úroveò adresáøe
pl_pl: Przejd¼ do poprzedniego katalogu

# lowres
source: Go up
cs_cz: Jít nahoru
pl_pl: W górê

source: Cancel
cs_cz: Zru¹it
pl_pl: Anuluj

source: Choose
cs_cz: Zvolit
pl_pl: Wybierz

source: Close
cs_cz: Zavøít
pl_pl: Zamknij

source: Mouse click
cs_cz: Kliknutí my¹í
pl_pl: Klikniêcie

source: Display keyboard
cs_cz: Zobrazit klávesnici
pl_pl: Wy¶wietl klawiaturê

source: Remap keys
cs_cz: Pøemapovat klávesy
pl_pl: Dostosuj klawisze

source: Toggle FullScreen
cs_cz: Pøepnout celou obrazovku
pl_pl: W³±cz/wy³±cz pe³ny ekran

source: Choose an action to map
cs_cz: Zvolte èinnost k mapování
pl_pl: Wybierz akcjê do przypisania

source: Map
cs_cz: Mapovat
pl_pl: Przypisz

source: Select an action and click 'Map'
cs_cz: Zvolte èinnost a kliknìte 'Mapovat'
pl_pl: Wybierz akcjê i kliknij 'Przypisz'

source: Associated key : %s
cs_cz: Pøiøazená klávesa: %s
pl_pl: Przypisany klawisz : %s

source: Associated key : none
cs_cz: Pøiøazená klávesa: ¾ádná
pl_pl: Przypisany klawisz: brak

source: Please select an action
cs_cz: Prosím vyberte èinnost
pl_pl: Wybierz akcjê

source: Press the key to associate
cs_cz: Zmáèknìte klávesu pro pøiøazení
pl_pl: Wci¶nij klawisz do przypisania

source: Game
cs_cz: Hra
pl_pl: Gra

source: Short game identifier used for referring to savegames and running the game from the command line
cs_cz: Krátký identifikátor her, pou¾ívaný jako odkaz k ulo¾eným hrám a spu¹tìní hry z pøíkazového øádku
pl_pl: Krótki identyfikator gry u¿ywany do rozpoznawania zapisów i uruchamiania gry z linii komend

source: Name:
cs_cz: Jméno
pl_pl: Nazwa:

source: Full title of the game
cs_cz: Úplný název hry
pl_pl: Pe³ny tytu³ gry:

# lowres
source: Name:
cs_cz: Jméno:
pl_pl: Nazwa:

source: Language:
cs_cz: Jazyk:
pl_pl: Jêzyk:

source: Language of the game. This will not turn your Spanish game version into English
cs_cz: Jazyk hry. Toto z Va¹í ©panìlské verze neudìlá Anglickou
pl_pl: Jêzyk gry. Nie zmieni to hiszpañskiej wersji gry w angielsk±.

source: <default>
cs_cz: <výchozí>
pl_pl: <domy¶lne>

source: Platform:
cs_cz: Platforma:
pl_pl: Platforma:

source: Platform the game was originally designed for
cs_cz: Platforma, pro kterou byla hra pùvodnì vytvoøena
pl_pl: Platforma, na któr± stworzono grê

# lowres
source: Platform:
cs_cz: Platforma:
pl_pl: Platforma:

source: Engine
cs_cz: Jádro
pl_pl: Silnik

source: Graphics
cs_cz: Obraz
pl_pl: Grafika

source: Override global graphic settings
cs_cz: Potlaèit globální nastavení obrazu
pl_pl: U¿yj w³asnych ustawieñ grafiki

# lowres
source: Override global graphic settings
cs_cz: Potlaèit globální nastavení obrazu
pl_pl: U¿yj w³asnych ustawieñ grafiki

source: Audio
cs_cz: Zvuk
pl_pl: D¼wiêk

source: Override global audio settings
cs_cz: Potlaèit globální nastavení zvuku
pl_pl: U¿yj w³asnych ustawieñ d¼wiêku

# lowres
source: Override global audio settings
cs_cz: Potlaèit globální nastavení zvuku
pl_pl: U¿yj w³asnych ustawieñ d¼wiêku

source: Volume
cs_cz: Hlasitost
pl_pl: G³o¶no¶æ

# lowres
source: Volume
cs_cz: Hlasitost
pl_pl: G³o¶no¶æ

source: Override global volume settings
cs_cz: Potlaèit globální nastavení hlasitosti
pl_pl: U¿yj w³asnych ustawieñ g³o¶no¶ci

# lowres
source: Override global volume settings
cs_cz: Potlaèit globální nastavení hlasitosti
pl_pl: U¿yj w³asnych ustawieñ g³o¶no¶ci

source: Override global MIDI settings
cs_cz: Potlaèit globální nastavení MIDI
pl_pl: U¿yj w³asnych ustawieñ MIDI

# lowres
source: Override global MIDI settings
cs_cz: Potlaèit globální nastavení MIDI
pl_pl: U¿yj w³asnych ustawieñ MIDI

source: Override global MT-32 settings
cs_cz: Potlaèit globální nastavení MT-32
pl_pl: U¿yj w³asnych ustawieñ MT-32

# lowres
source: Override global MT-32 settings
cs_cz: Potlaèit globální nastavení MT-32
pl_pl: U¿yj w³asnych ustawieñ MT-32

source: Paths
cs_cz: Cesty
pl_pl: ¦cie¿ki

# lowres
source: Paths
cs_cz: Cesty
pl_pl: ¦cie¿ki

source: Game Path:
cs_cz: Cesta Hry:
pl_pl: ¦cie¿ka gry:

# lowres
source: Game Path:
cs_cz: Cesta Hry:
pl_pl: ¦cie¿ka gry:

source: Extra Path:
cs_cz: Dodateèná Cesta:
pl_pl: ¦c. dodatków:

source: Specifies path to additional data used the game
cs_cz: Stanoví cestu pro dodateèná data pou¾itá ve høe
pl_pl: Okre¶la ¶cie¿kê dodatkowych danych gry

# lowres
source: Extra Path:
cs_cz: Dodateèná Cesta:
pl_pl: ¦c. dodatków:

source: Save Path:
cs_cz: Cesta pro ulo¾ení:
pl_pl: ¦cie¿ka zapisów:

source: Specifies where your savegames are put
cs_cz: Stanovuje, kam jsou umístìny va¹e ulo¾ené hry
pl_pl: Okre¶la gdzie zapisywaæ stan gry

# lowres
source: Save Path:
cs_cz: Cesta pro ulo¾ení:
pl_pl: ¦cie¿ka zapisów:

# path
source: None
cs_cz: ®ádné
pl_pl: Brak

source: Default
cs_cz: Výchozí
pl_pl: Domy¶lnie

source: Select SoundFont
cs_cz: Vybrat SoundFont
pl_pl: Wybierz SoundFont

source: Select directory with game data
cs_cz: Vyberte adresáø s daty hry
pl_pl: Wybierz katalog z plikami gry

source: Select additional game directory
cs_cz: Vyberte dodateèný adresáø hry
pl_pl: Wybierz dodatkowy katalog gry

source: Select directory for saved games
cs_cz: Vyberte adresáø pro ulo¾ené hry
pl_pl: Wybierz katalog dla zapisów

source: This game ID is already taken. Please choose another one.
cs_cz: Toto ID hry je u¾ zabrané. Vyberte si, prosím, jiné.
pl_pl: Identyfikator jest ju¿ zajêty. Wybierz inny.

source: ~Q~uit
cs_cz: ~U~konèit
pl_pl: ~Z~akoñcz

source: Quit ScummVM
cs_cz: Ukonèit ScummVM
pl_pl: Zakoñcz ScummVM

source: A~b~out...
cs_cz: ~O~ Programu...
pl_pl: I~n~formacje...

source: About ScummVM
cs_cz: O ScummVM
pl_pl: Ksi±¿ka ScummVM

source: ~O~ptions...
cs_cz: ~V~olby...
pl_pl: ~O~pcje...

source: Change global ScummVM options
cs_cz: Zmìnit globální volby ScummVM
pl_pl: Zmieñ ustawienia ScummVM

source: ~S~tart
cs_cz: ~S~pustit

source: Start selected game
cs_cz: Spustit zvolenou hru
pl_pl: Rozpocznij wybran± grê

source: ~L~oad...
cs_cz: ~N~ahrát...
pl_pl: ~W~czytaj...

source: Load savegame for selected game
cs_cz: Nahrát ulo¾enou pozici pro zvolenou hru
pl_pl: Wczytaj zapis wybranej gry

source: ~A~dd Game...
cs_cz: ~P~øidat hru...
pl_pl: ~D~odaj grê...

source: Hold Shift for Mass Add
cs_cz: Podr¾te Shift pro Hromadné Pøidání
pl_pl: Przytrzymaj Shift, by dodawaæ zbiorowo

source: ~E~dit Game...
cs_cz: ~U~pravit Hru...
pl_pl: ~E~dytuj grê...

source: Change game options
cs_cz: Zmìnit volby hry
pl_pl: Zmieñ opcje gry

source: ~R~emove Game
cs_cz: ~O~dstranit Hru
pl_pl: ~U~suñ grê

source: Remove game from the list. The game data files stay intact
cs_cz: Odstranit hru ze seznamu. Herní data zùstanou zachována
pl_pl: Usuwa grê z listy. Pliki gry pozostaj± nietkniête

# lowres
source: ~A~dd Game...
cs_cz: ~P~øidat hru...
pl_pl: ~D~odaj grê...

# lowres
source: ~E~dit Game...
cs_cz: ~U~pravit hru...
pl_pl: ~E~dytuj grê...

# lowres
source: ~R~emove Game
cs_cz: ~O~dstranit hru
pl_pl: ~U~suñ grê

source: Search in game list
cs_cz: Hledat v seznamu her
pl_pl: Wyszukaj grê na li¶cie

source: Search:
cs_cz: Hledat:
pl_pl: Szukaj

source: Load game:
cs_cz: Nahrát hru:
pl_pl: Wczytaj grê:

source: Load
cs_cz: Nahrát
pl_pl: Wczytaj

source: Do you really want to run the mass game detector? This could potentially add a huge number of games.
cs_cz: Opravdu chcete spustit hromadnou detekci her? Toto by mohlo potenciálnì pøidat velkou spoustu her.
pl_pl: Chcesz uruchomiæ masowy detektor gier? Mo¿e dodaæ wiele tytu³ów do listy

source: Yes
cs_cz: Ano
pl_pl: Tak

source: No
cs_cz: Ne
pl_pl: Nie

source: ScummVM couldn't open the specified directory!
cs_cz: ScummVM nemohl tento adresáø otevøít!
pl_pl: ScummVM nie mo¿e otworzyæ katalogu!

source: ScummVM could not find any game in the specified directory!
cs_cz: ScummVM nemohl v zadaném adresáøi najít ¾ádnou hru!
pl_pl: ScummVM nie znalaz³ ¿adnej gry w tym katalogu!

source: Pick the game:
cs_cz: Vybrat hru:
pl_pl: Wybierz grê:

source: Do you really want to remove this game configuration?
cs_cz: Opravdu chcete odstranit nastavení této hry?
pl_pl: Na pewno chcesz usun±æ tê grê z konfiguracji?

source: This game does not support loading games from the launcher.
cs_cz: Tato hra nepodporuje spou¹tìní her ze spou¹tìèe
pl_pl: Ta gra nie wspiera wczytywania z launchera.

source: ScummVM could not find any engine capable of running the selected game!
cs_cz: ScummVM nemohl najít ¾ádné jádro schopné vybranou hru spustit!
pl_pl: ScummVM nie znalaz³ silnika zdolnego uruchomiæ wybran± grê!

# lowres
source: Mass Add...
cs_cz: Hromadné Pøidání...
pl_pl: Masowe dodawanie...

source: Mass Add...
cs_cz: Hromadné Pøidání...
pl_pl: Masowe dodawanie...

source: ... progress ...
cs_cz: ... prùbìh ...
pl_pl: ... postêp ...

source: Scan complete!
cs_cz: Hledání dokonèeno!
pl_pl: Skanowanie zakoñczone!

source: Discovered %d new games, ignored %d previously added games.
cs_cz: Objeveno %d nových her, ignorováno %d døíve pøidaných her.
pl_pl: Wykryto %d nowych gier, zignorowano %d poprzednio dodanych.

source: Scanned %d directories ...
cs_cz: Prohledáno %d adresáøù...
pl_pl: Przeskanowano %d katalogów ...

source: Discovered %d new games, ignored %d previously added games ...
cs_cz: Objeveno %d nových her, ignorováno %d døíve pøidaných her ...
pl_pl: Wykryto %d nowych gier, zignorowano %d poprzednio dodanych...

source: Never
cs_cz: Nikdy
pl_pl: Nigdy

source: every 5 mins
cs_cz: Ka¾dých 5 min
pl_pl: co 5 min

source: every 10 mins
cs_cz: Ka¾dých 10 min
pl_pl: co 10 min

source: every 15 mins
cs_cz: Ka¾dých 15 min
pl_pl: co 15 min

source: every 30 mins
cs_cz: Ka¾dých 30 min
pl_pl: co 30 min

# soundfont
source: None
cs_cz: ®ádné
pl_pl: Brak

source: Failed to apply some of the graphic options changes:
cs_cz: Nelze pou¾ít nìkteré zmìny mo¾ností grafiky:
pl_pl: Nie uda³o siê zastosowaæ czê¶ci zmian opcji grafiki:

source: the video mode could not be changed.
cs_cz: re¾im obrazu nemohl být zmìnìn.
pl_pl: nie uda³o siê zmieniæ trybu wideo.

source: the fullscreen setting could not be changed
cs_cz: nastavení celé obrazovky nemohlo být zmìnìno
pl_pl: nie uda³o siê zmieniæ trybu pe³noekranowego

source: the aspect ratio setting could not be changed
cs_cz: nastavení pomìru stran nemohlo být zmìnìno
pl_pl: nie uda³o siê zmieniæ formatu obrazu

source: Graphics mode:
cs_cz: Re¾im obrazu:
pl_pl: Tryb grafiki:

source: Render mode:
cs_cz: Re¾im vykreslení:
pl_pl: Renderer:

source: Special dithering modes supported by some games
cs_cz: Speciální re¾imy chvìní podporované nìkterými hrami
pl_pl: Specjalne tryby ditheringu wspierane przez niektóre gry

source: Fullscreen mode
cs_cz: Re¾im celé obrazovky
pl_pl: Pe³ny ekran

source: Aspect ratio correction
cs_cz: Korekce pomìru stran
pl_pl: Korekcja formatu obrazu

source: Correct aspect ratio for 320x200 games
cs_cz: Korigovat pomìr stran pro hry 320x200
pl_pl: Korekcja formatu obrazu dla gier 320x200

source: Preferred Device:
cs_cz: Prioritní Zaøízení:
pl_pl: Pref. urz±dzenie:

source: Music Device:
cs_cz: Hudební zaøízení
pl_pl: Urz. muzyczne:

source: Specifies preferred sound device or sound card emulator
cs_cz: Stanoví prioritní zvukové zaøízení nebo emulátor zvukové karty
pl_pl: Okre¶la preferowane urz±dzenie d¼wiêkowe lub emulator karty d¼wiêkowej

source: Specifies output sound device or sound card emulator
cs_cz: Stanoví výstupní zvukové zaøízení nebo emulátor zvukové karty
pl_pl: Okre¶la wyj¶ciowe urz±dzenie d¼wiêkowe lub emulator karty d¼wiêkowej

# lowres
source: Preferred Dev.:
cs_cz: Prioritní Zaø.:
pl_pl: Pref. urz±dzenie:

# lowres
source: Music Device:
cs_cz: Hudební zaøízení
pl_pl: Urz. muzyczne:

source: AdLib emulator:
cs_cz: AdLib emulátor
pl_pl: Emulator AdLib:

source: AdLib is used for music in many games
cs_cz: AdLib se pou¾ívá pro hudbu v mnoha hrách
pl_pl: AdLib jest u¿ywany do muzyki w wielu grach

source: Output rate:
cs_cz: Výstup. frekvence:
pl_pl: Czêst. wyj.:

source: Higher value specifies better sound quality but may be not supported by your soundcard
cs_cz: Vy¹¹í hodnota zpùsobí lep¹í kvalitu zvuku, ale nemusí být podporována Va¹i zvukovou kartou
pl_pl: Wy¿sze warto¶ci daj± lepsz± jako¶æ d¼wiêku, ale mog± byæ nieobs³ugiwane przez twoj± kartê d¼wiêkow±

source: GM Device:
cs_cz: GM Zaøízení:
pl_pl: Urz±dzenie GM:

source: Specifies default sound device for General MIDI output
cs_cz: Stanoví výchozí zvukové zaøízení pro výstup General MIDI
pl_pl: Okre¶la domy¶lne urz±dzenie d¼wiêkowe dla wyj¶cia General MIDI

source: Don't use General MIDI music
cs_cz: Nepou¾ívat hudbu General MIDI
pl_pl: Nie u¿ywaj muzyki General MIDI

source: Use first available device
cs_cz: Pou¾ít první dostupné zaøízení
pl_pl: U¿yj pierwszego dostêpnego urz±dzenia

source: SoundFont is supported by some audio cards, Fluidsynth and Timidity
cs_cz: SoundFont je podporován nìkterými zvukovými kartami, Fluidsynth a Timidity
pl_pl: SoundFont jest wspierany przez niektóre karty d¼wiêkowe, Fluidsynth i Timidity

source: Mixed AdLib/MIDI mode
cs_cz: Smí¹ený re¾im AdLib/MIDI
pl_pl: Tryb miksowanego AdLib/MIDI

source: Use both MIDI and AdLib sound generation
cs_cz: Pou¾ít obì zvukové generace MIDI a AdLib
pl_pl: U¿ywaj obu generatorów d¼wiêku, MIDI i AdLib, jednocze¶nie

source: MIDI gain:
cs_cz: Zesílení MIDI:
pl_pl: Wzm. MIDI:

source: MT-32 Device:
cs_cz: Zaøízení MT-32:
pl_pl: Urz±dzenie MT-32:

source: Specifies default sound device for Roland MT-32/LAPC1/CM32l/CM64 output
cs_cz: Stanoví výchozí zvukové výstupní zaøízení pro Roland MT-32/LAPC1/CM32l/CM64
pl_pl: Okre¶la domy¶lne urz±dzenie d¼wiêku dla wyj¶cia Roland MT-32/LAPC1/CM32l/CM64

source: True Roland MT-32 (disable GM emulation)
cs_cz: Opravdový Roland MT-32 (vypne GM emulaci)
pl_pl: Prawdziwy Roland MT-32 (wy³±cz emulacjê GM)

source: Check if you want to use your real hardware Roland-compatible sound device connected to your computer
cs_cz: Za¹krtnìte, pokud chcete pou¾ít pravé hardwarové zaøízení kompatibilní s Roland, pøipojené k va¹emu poèítaèi
pl_pl: Zaznacz, je¶li chcesz u¿ywaæ swojej prawdziwej karty kompatybilnej z Roland pod³±czonej do twojego komputera

# lowres
source: True Roland MT-32 (no GM emulation)
cs_cz: Opravdový Roland MT-32 (¾ádná GM emulace)
pl_pl: Prawdziwy Roland MT-32 (brak emulacji GM)

source: Enable Roland GS Mode
cs_cz: Zapnout re¾im Roland GS
pl_pl: W³±cz tryb Roland GS

source: Turns off General MIDI mapping for games with Roland MT-32 soundtrack
cs_cz: Vypne mapování General MIDI pro hry s Roland MT-32 zvukovým doprovodem
pl_pl: Wy³±cza mapowanie General MIDI dla gier ze ¶cie¿k± d¼wiêkow± Roland MT-32

source: Don't use Roland MT-32 music
cs_cz: Nepou¾ívat hudbu Roland MT-32
pl_pl: Nie u¿ywaj muzyki Roland MT-32

source: Text and Speech:
cs_cz: Text a Øeè
pl_pl: Tekst i mowa:

source: Speech
cs_cz: Øeè
pl_pl: Mowa

source: Subtitles
cs_cz: Titulky
pl_pl: Napisy

source: Both
cs_cz: Oba
pl_pl: Oba

source: Subtitle speed:
cs_cz: Rychlost titulkù:
pl_pl: Prêd. napisów:

# lowres
source: Text and Speech:
cs_cz: Text a Øeè:
pl_pl: Tekst i mowa:

source: Spch
cs_cz: Øeè
pl_pl: Mowa

source: Subs
cs_cz: Titl
pl_pl: Napisy

# lowres
source: Both
cs_cz: Oba
pl_pl: Oba

source: Show subtitles and play speech
cs_cz: Zobrazit titulky a pøehrávat øeè
pl_pl: Wy¶wietlaj napisy i odtwarzaj mowê

# lowres
source: Subtitle speed:
cs_cz: Rychlost titulkù
pl_pl: Prêd. napisów:

source: Music volume:
cs_cz: Hlasitost hudby
pl_pl: G³o¶no¶æ muzyki:

# lowres
source: Music volume:
cs_cz: Hlasitost hudby
pl_pl: G³o¶no¶æ muzyki:

source: Mute All
cs_cz: Ztlumit V¹e
pl_pl: Wycisz

source: SFX volume:
cs_cz: Hlasitost zvukù
pl_pl: G³. efekt. d¼w.:

source: Special sound effects volume
cs_cz: Hlasitost speciálních zvukových efektù
pl_pl: G³o¶no¶æ efektów d¼w.

# lowres
source: SFX volume:
cs_cz: Hlasitost zvukù
pl_pl: G³. efekt. d¼w.:

source: Speech volume:
cs_cz: Hlasitost øeèi
pl_pl: G³o¶no¶æ mowy:

# lowres
source: Speech volume:
cs_cz: Hlasitost øeèi
pl_pl: G³o¶no¶æ mowy:

source: Theme Path:
cs_cz: Cesta ke Vzhledu:
pl_pl: ¦cie¿ka stylu:

# lowres
source: Theme Path:
cs_cz: Cesta ke Vzhledu:
pl_pl: ¦cie¿ka stylu:

source: Specifies path to additional data used by all games or ScummVM
cs_cz: Stanoví cestu k dodateèným datùm pou¾ívaná v¹emi hrami nebo ScummVM
pl_pl: Okre¶la ¶cie¿kê dla dodatkowych danych dla wszystkich gier lub ScummVM

source: Plugins Path:
cs_cz: Cesta k Pluginùm:
pl_pl: ¦cie¿ka wtyczek:

# lowres
source: Plugins Path:
cs_cz: Cesta k Pluginùm:
pl_pl: ¦cie¿ka wtyczek:

source: Misc
cs_cz: Rùzné
pl_pl: Ró¿ne

# lowres
source: Misc
cs_cz: Rùzné
pl_pl: Ró¿ne

source: Theme:
cs_cz: Vzhled:
pl_pl: Styl:

source: GUI Renderer:
cs_cz: GUI Vykreslovaè:
pl_pl: Renderer interf.:

source: Autosave:
cs_cz: Autoukládání:
pl_pl: Autozapis:

# lowres
source: Autosave:
cs_cz: Autoukládání:
pl_pl: Autozapis:

source: Keys
cs_cz: Klávesy
pl_pl: Klawisze

source: GUI Language:
cs_cz: Jazyk GUI
pl_pl: Jêzyk interfejsu:

source: Language of ScummVM GUI
cs_cz: Jazyk GUI ScummVM
pl_pl: Jêzyk interfejsu ScummVM

source: You have to restart ScummVM before your changes will take effect.
cs_cz: Pro pou¾ití tìchto nastavení musíte restartovat ScummVM.
pl_pl: Musisz zrestartowaæ ScummVM, by zmiany zosta³y uwzglêdnione.

source: Select directory for savegames
cs_cz: Vybrat adresáø pro ulo¾ené hry
pl_pl: Wybierz katalog zapisów

source: The chosen directory cannot be written to. Please select another one.
cs_cz: Do zvoleného adresáøe nelze zapisovat. Vyberte, prosím, jiný.
pl_pl: Ten katalog jest zabezpieczony przed zapisem. Wybierz inny.

source: Select directory for GUI themes
cs_cz: Vyberte adresáø pro vhledy GUI
pl_pl: Wybierz katalog dla stylów GUI.

source: Select directory for extra files
cs_cz: Vyberte adresáø pro dodateèné soubory
pl_pl: Wybierz katalog dla dodatkowych plików

source: Select directory for plugins
cs_cz: Vyberte adresáø pro zásuvné moduly
pl_pl: Wybierz katalog dla wtyczek

source: The theme you selected does not support your current language. If you want to use this theme you need to switch to another language first.
cs_cz: Vzhled, který jste zvolili, nepodporuje Vá¹ souèasný jazyk. Pokud chcete tento vzhled pou¾ít, musíte nejdøíve pøepnout na jiný jazyk.
pl_pl: Wybrany styl nie obs³uguje obecnego jêzyka. Je¶li chcesz go u¿ywaæ, zmieñ najpierw swój jêzyk.

source: No date saved
cs_cz: Neulo¾ena ¾ádná data
pl_pl: Brak daty

source: No time saved
cs_cz: ®ádný ulo¾ený èas
pl_pl: Brak godziny

source: No playtime saved
cs_cz: ®ádná ulo¾ená doba hraní
pl_pl: Brak czasu gry

source: Delete
cs_cz: Smazat
pl_pl: Skasuj

source: Do you really want to delete this savegame?
cs_cz: Opravdu chcete tuto ulo¾enou hru vymazat
pl_pl: Na pewno chcesz skasowaæ ten zapis?

source: Date:
cs_cz: Datum:
pl_pl: Data:

source: Time:
cs_cz: Èas:
pl_pl: Czas:

source: Playtime:
cs_cz: Doba hraní:
pl_pl: Czas gry:

source: Untitled savestate
cs_cz: Bezejmenný ulo¾ený stav
pl_pl: Zapis bez nazwy

source: Select a Theme
cs_cz: Vyberte Vzhled
pl_pl: Wybierz styl

source: Disabled GFX
cs_cz: GFX zakázáno
pl_pl: Wy³±czona grafika

# lowres
source: Disabled GFX
cs_cz: GFX zakázáno
pl_pl: Wy³±czona grafika

source: Standard Renderer (16bpp)
cs_cz: Standardní Vykreslovaè (16bpp)
pl_pl: Standardowy renderer (16bpp)

source: Standard (16bpp)
cs_cz: Standardní (16bpp)
pl_pl: Standardowy (16bpp)

source: Antialiased Renderer (16bpp)
cs_cz: Vykreslovaè s vyhlazenými hranami (16bpp)
pl_pl: Wyg³adzany renderer (16bpp)

source: Antialiased (16bpp)
cs_cz: S vyhlazenými hranami (16bpp)
pl_pl: Wyg³adzany (16bpp)

source: Clear value
cs_cz: Vyèistit hodnotu
pl_pl: Wyczy¶æ

source: Engine does not support debug level '%s'
cs_cz: Jádro nepodporuje úroveò ladìní '%s'
pl_pl: Silnik nie wspiera poziomu debugowania '%s'

source: Skip
cs_cz: Pøeskoèit
pl_pl: Pomiñ

source: Pause
cs_cz: Pauza
pl_pl: Wstrzymaj

source: Skip line
cs_cz: Pøeskoèit øádek
pl_pl: Pomiñ liniê

source: Error running game:
cs_cz: Chyba pøi spu¹tìní hry:
pl_pl: B³±d podczas uruchamiania gry:

source: Could not find any engine capable of running the selected game
cs_cz: Nelze nalézt ¾ádné jádro schopné vybranou hru spustit
pl_pl: Nie uda³o siê znale¼æ silnika zdolnego do uruchomienia zaznaczonej gry

source: No error
cs_cz: ®ádná chyba
pl_pl: Brak b³êdu

source: Game data not found
cs_cz: Data hry nenalezena
pl_pl: Nie znaleziono plików gry

source: Game id not supported
cs_cz: Id hry není podporováno
pl_pl: Identyfikator gry nie jest wspierany

source: Unsupported color mode
cs_cz: Nepodporovaný barevný re¾im
pl_pl: Niewspierany tryb kolorów

source: Read permission denied
cs_cz: Oprávnìní ke ètení zamítnuto
pl_pl: Brak praw do odczytu

source: Write permission denied
cs_cz: Oprávnìní k zápisu zamítnuto
pl_pl: Brak praw do zapisu

source: Path does not exist
cs_cz: Cesta neexistuje
pl_pl: ¦cie¿ka nie istnieje

source: Path not a directory
cs_cz: Cesta není adresáø
pl_pl: ¦cie¿ka nie jest katalogiem

source: Path not a file
cs_cz: Cesta není soubor
pl_pl: ¦cie¿ka nie jest plikiem

source: Cannot create file
cs_cz: Nelze vytvoøit soubor
pl_pl: Nie mo¿na utworzyæ pliku

source: Reading data failed
cs_cz: Ètení dat selhalo
pl_pl: Odczyt danych nieudany

source: Writing data failed
cs_cz: Zápis dat selhal
pl_pl: Zapisywanie danych nie powiod³o siê

source: Could not find suitable engine plugin
cs_cz: Nelze nalézt vhodný zás. modul jádra
pl_pl: Nie uda³o siê znale¼æ odpowiedniej wtyczki silnika

source: Engine plugin does not support save states
cs_cz: Zás. modul jádra nepodporuje ulo¾ené stavy
pl_pl: Silnik nie wspiera zapisu stanu gry

source: User canceled
cs_cz: Zru¹eno u¾ivatelem
pl_pl: Przerwane przez u¿ytkownika

source: Unknown error
cs_cz: Neznámá chyba
pl_pl: Nieznany b³±d

source: The game in '%s' seems to be unknown.
cs_cz: Hra v '%s' se zdá být neznámá.
pl_pl: Gra w '%s' wygl±da na nieznan±.

source: Please, report the following data to the ScummVM team along with name
cs_cz: Prosím nahlaste následující data týmu ScummVM spolu se jménem
pl_pl: Przeka¿ poni¿sze dane zespo³owi ScummVM razem z nazw±

source: of the game you tried to add and its version/language/etc.:
cs_cz: hry, kterou jste se pokusili pøidat a její verzi/jazyk/atd.:
pl_pl: gry, któr± próbowa³e¶ dodaæ oraz jej wersj±, jêzykiem itd.:

source: ~R~esume
cs_cz: ~P~okraèovat
pl_pl: ~W~znów

source: ~L~oad
cs_cz: ~N~ahrát
pl_pl: ~W~czytaj

source: ~S~ave
cs_cz: ~U~lo¾it
pl_pl: ~Z~apisz

source: ~O~ptions
cs_cz: ~V~olby
pl_pl: ~O~pcje

source: ~H~elp
cs_cz: ~N~ápovìda
pl_pl: ~P~omoc

source: ~A~bout
cs_cz: ~O~ programu
pl_pl: ~I~nformacje

source: ~R~eturn to Launcher
cs_cz: ~N~ávrat do Spou¹tìèe
pl_pl: ~P~owrót do launchera

# lowres
source: ~R~eturn to Launcher
cs_cz: ~N~ávrat do Spou¹tìèe
pl_pl: ~P~owrót do launchera

source: Save game:
cs_cz: Ulo¾it hru:
pl_pl: Zapis:

source: Save
cs_cz: Ulo¾it
pl_pl: Zapisz

source: Sorry, this engine does not currently provide in-game help. Please consult the README for basic information, and for instructions on how to obtain further assistance.
cs_cz: Je nám líto, ale toto jádro v souèasnosti nepodporuje herní nápovìdu. Prosím prohlédnìte si README pro základní informace a pro instrukce jak získat dal¹í pomoc.
pl_pl: Przepraszamy, ten silnik obecnie nie oferuje pomocy wewn±trz gry. Aby uzyskaæ podstawowe informacje oraz dowiedzieæ jak szukaæ dalszej pomocy, sprawd¼ plik README.
