Repository: OpenEmu/OpenEmu
Catalog: ScummVM/scummvm/po/*.po
Languages: cs_cz, pl_pl

source: ScummVM found that you have old savefiles for Broken Sword 1 that should be converted. The old save game format is no longer supported, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked again the next time you start the game.
cs_cz: ScummVM zjistil, ¾e máte staré ulo¾ené pozice pro Broken Sword 1, které by mìly být pøevedeny. Starý formát ulo¾ených her ji¾ není podporován, tak¾e pokud je nepøevedete, nebudete moci va¹e hry naèíst. Stisknìte OK, abyste je pøevedli teï, jinak budete po¾ádáni znovu, pøi spu¹tìní této hry.
pl_pl: ScummVM znalaz³ stare zapisy z Broken Sword 1, które nale¿y przekonwertowaæ. Stary format zapisu nie jest ju¿ obs³ugiwany. Nie bêdziesz móg³ wczytaæ zapisów, je¶li ich nie przekonwertujesz. Naci¶nij OK, ¿eby je teraz przekonwertowaæ. W przeciwnym wypadku zostaniesz zapytany ponownie przy nastêpnym w³±czeniu gry.

source: Target new save game already exists! Would you like to keep the old save game (%s) or the new one (%s)?
cs_cz: Nová cílová ulo¾ená hra ji¾ existuje! Chtìli byste ponechat starou ulo¾enou hru (%s), nebo novou (%s)?
pl_pl: Docelowy plik nowego zapisu ju¿ istnieje! Chcesz zachowaæ stary zapis (%s) czy nowy (%s)?

source: Keep the old one
cs_cz: Ponechat starou
pl_pl: Zachowaj stary

source: Keep the new one
cs_cz: Ponechat novou
pl_pl: Zachowaj nowy

source: This is the end of the Broken Sword 1 Demo
cs_cz: Toto je konec Dema Broken Sword 1
pl_pl: To koniec dema Broken Sword 1

source: PSX cutscenes found but ScummVM has been built without RGB color support
cs_cz: Videa PSX nalezena, ale ScummVM byl sestaven bez podpory barev RGB
pl_pl: Znaleziono przerywniki PSX, ale ScummVM jest skompilowany bez obs³ugi trybu RGB

source: Show object labels
cs_cz: Zobrazit jmenovky objektù
pl_pl: Poka¿ etykiety obiektów

source: Show labels for objects on mouse hover
cs_cz: Zobrazit jmenovky objektù pøi najetí my¹i
pl_pl: Poka¿ etykiety obiektów przy najechaniu myszk±

source: Can't save game in slot %i
cs_cz: Nelze ulo¾it hru do pozice %i
pl_pl: Nie mo¿na zapisaæ w slocie %i

source: Loading game...
cs_cz: Nahrávání hry...
pl_pl: Wczytywanie stanu gry...

source: Saving game...
cs_cz: Ukládání hry...
pl_pl: Zapisywanie stanu gry...

source: ScummVM found that you have old savefiles for Nippon Safes that should be renamed. The old names are no longer supported, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked next time.
cs_cz: ScummVM zjistil, ¾e máte staré ulo¾ené pozice pro Nippon Safes, které by mìly být pøejmenovány. Staré názvy ji¾ nejsou podporovány, tak¾e pokud je nepøevedete, nebudete moci va¹e hry naèíst. Stisknìte OK, abyste je pøevedli teï, jinak budete po¾ádáni pøí¹tì.
pl_pl: ScummVM znalaz³ stare zapisy z Nippon Safes, które nale¿y przekonwertowaæ. Stary format zapisu nie jest ju¿ obs³ugiwany. Nie bêdziesz móg³ wczytaæ zapisów, je¶li ich nie przekonwertujesz. Naci¶nij OK, ¿eby je teraz przekonwertowaæ. W przeciwnym wypadku zostaniesz zapytany ponownie przy nastêpnym w³±czeniu gry.

source: ScummVM successfully converted all your savefiles.
cs_cz: ScummVM úspì¹nì pøevedl v¹echny va¹e ulo¾ené pozice.
pl_pl: ScummVM pomy¶lnie przekonwertowa³ wszystkie twoje zapisy.

source: ScummVM printed some warnings in your console window and can't guarantee all your files have been converted. Please report to the team.
cs_cz: ScummVM vytiskl nìkterá varování ve va¹em oknì konzole a nemù¾e zaruèit, ¾e v¹echny va¹e soubory byly pøevedeny. Prosím nahlaste to týmu
pl_pl: ScummVM wy¶wietli³ ostrze¿enia w oknie konsoli i nie mo¿e zagwarantowaæ, ¿e wszystkie twoje pliki zosta³y przekonwertowane. Prosimy o zg³oszenie tego zespo³owi.

source: MAME OPL emulator
cs_cz: MAME OPL Emulátor
pl_pl: Emulator OPL MAME

source: DOSBox OPL emulator
cs_cz: DOSBox OPL Emulátor
pl_pl: Emulator OPL DOSBox

source: The selected audio device '%s' was not found (e.g. might be turned off or disconnected).
cs_cz: Zvolené zvukové zaøízení '%s' nebylo nalezeno (napø. mù¾e být vypnuto nebo odpojeno).
pl_pl: Nie znaleziono wybranego urz±dzenia audio '%s' (mo¿e byæ wy³±czone albo niepod³±czone).

source: Attempting to fall back to the next available device...
cs_cz: Pokus o navrácení na nejbli¾¹í dostupné zaøízení...
pl_pl: Próbujê u¿yæ nastêpnego dostêpnego urz±dzenia...

source: The selected audio device '%s' cannot be used. See log file for more information.
cs_cz: Zvolené zvukové zaøízení '%s' nelze pou¾ít. Podívejte se na záznam pro více informací.
pl_pl: Nie mo¿na u¿yæ wybranego urz±dzenia audio '%s'. Dalsze szczegó³y s± dostêpne w pliku dziennika.

source: The preferred audio device '%s' was not found (e.g. might be turned off or disconnected).
cs_cz: Upøednostòované zvukové zaøízení '%s' nebylo nalezeno (napø. mù¾e být vypnuto nebo odpojeno).
pl_pl: Nie znaleziono preferowanego urz±dzenia audio '%s' (mo¿e byæ wy³±czone albo niepod³±czone).

source: The preferred audio device '%s' cannot be used. See log file for more information.
cs_cz: Upøednostòované zvukové zaøízení '%s' nelze pou¾ít. Podívejte se na záznam pro více informací.
pl_pl: Nie mo¿na u¿yæ preferowanego urz±dzenia audio '%s'. Dalsze szczegó³y s± dostêpne w pliku dziennika.

source: No music
cs_cz: Bez hudby
pl_pl: Brak muzyki

source: Amiga Audio Emulator
cs_cz: Emulátor zvuku Amiga
pl_pl: Emulator d¼wiêku Amigi

source: AdLib Emulator
cs_cz: AdLib Emulátor
pl_pl: Emulator AdLib

source: Apple II GS Emulator (NOT IMPLEMENTED)
cs_cz: Apple II GS Emulátor (NENÍ ZAVEDEN)
pl_pl: Emulator Apple II GS (NIE ZAIMPLEMENTOWANY)

source: C64 Audio Emulator
cs_cz: Emulátor zvuku C64
pl_pl: Emulator d¼wiêku C64

source: Initializing MT-32 Emulator
cs_cz: Zavádím MT-32 Emulátor
pl_pl: Inicjalizacja emulatora MT-32

source: MT-32 Emulator
cs_cz: MT-32 Emulátor
pl_pl: Emulator MT-32

source: PC Speaker Emulator
cs_cz: PC Speaker Emulátor
pl_pl: Emulator brzêczyka

source: IBM PCjr Emulator
cs_cz: IBM PCjr Emulátor
pl_pl: Emulator IBM PCjr

source: Keymap:
cs_cz: Mapa Kláves:
pl_pl: Klawisze:

source: (Effective)
cs_cz: (Aktivní)
pl_pl: (Dzia³a)

source: (Active)
cs_cz: (Aktivní)
pl_pl: (Aktywny)

source: (Blocked)
cs_cz: (Blokováno)
pl_pl: (Zablokowany)

source: (Global)
cs_cz: (Globální)
pl_pl: (Globalny)

source: (Game)
cs_cz: (Hra)
pl_pl: (Gra)

source: ScummVM Main Menu
cs_cz: Hlavní Menu ScummVM
pl_pl: G³ówne menu ScummVM

source: ~L~eft handed mode
cs_cz: ~R~e¾im pro leváky
pl_pl: ~T~ryb dla leworêcznych

source: ~I~ndy fight controls
cs_cz: ~O~vládání Indyho boje
pl_pl: ~S~terowanie walcz±cym Indym

source: Show mouse cursor
cs_cz: Zobrazit kurzor my¹i
pl_pl: Wy¶wietl kursor myszy

source: Snap to edges
cs_cz: Pøichytit k okrajùm
pl_pl: Przyci±ganie do krawêdzi

source: Touch X Offset
cs_cz: Dotykové vyrovnáni na ose X
pl_pl: Przesuniêcie X ekranu do dotykania

source: Touch Y Offset
cs_cz: Dotykové vyrovnáni na ose Y
pl_pl: Przesuniêcie Y ekranu do dotykania

source: Use laptop trackpad-style cursor control
cs_cz: Pou¾ít styl kontroly kurzoru jako u ovládací podu¹ky laptopu
pl_pl: U¿yj kursora w stylu trackpada z laptopa do sterowania

source: Tap for left click, double tap right click
cs_cz: «uknìte pro levé kliknutí, dvakrát pro pravé kliknutí
pl_pl: Puknij raz, aby klikn±æ LPM; dwa razy, aby klikn±æ PPM

source: Sensitivity
cs_cz: Citlivost
pl_pl: Czu³o¶æ

source: Initial top screen scale:
cs_cz: Poèáteèní zmìna velikosti horní obrazovky:
pl_pl: Wstêpna skala górnego ekranu:

source: Main screen scaling:
cs_cz: Zmìna velikosti hlavní obrazovky:
pl_pl: Skalowanie g³ównego ekranu:

source: Hardware scale (fast, but low quality)
cs_cz: Hardwarová zmìna velikosti (rychlé, ale nízká kvalita)
pl_pl: Skalowanie sprzêtowe (szybsze, ale ni¿szej jako¶ci)

source: Software scale (good quality, but slower)
cs_cz: Softwarová zmìna velikosti (dobrá kvalita, ale pomalej¹í)
pl_pl: Skalowanie programowe (wy¿szej jako¶ci, ale wolniejsze)

source: Unscaled (you must scroll left and right)
cs_cz: Beze zmìny velikosti (musíte posunovat doleva a doprava)
pl_pl: Nieskalowany (musisz przewijaæ w lewo i prawo)

source: Brightness:
cs_cz: Jas:
pl_pl: Jasno¶æ:

source: High quality audio (slower) (reboot)
cs_cz: Vysoká kvalita zvuku (pomalej¹í) (restart)
pl_pl: D¼wiêk wysokiej jako¶ci (wolniejszy) (restart)

source: Disable power off
cs_cz: Zakázat vypnutí
pl_pl: Nie wy³±czaj zasilania

source: Mouse-click-and-drag mode enabled.
cs_cz: Re¾im pøetáhnutí my¹i zapnut.
pl_pl: W³±czono tryb kliknij i przeci±gaj.

source: Mouse-click-and-drag mode disabled.
cs_cz: Re¾im pøetáhnutí my¹i vypnut.
pl_pl: Wy³±czono tryb kliknij i przeci±gaj.

source: Touchpad mode enabled.
cs_cz: Touchpad re¾im zapnut
pl_pl: Tryb touchpada w³±czony.

source: Touchpad mode disabled.
cs_cz: Touchpad re¾im vypnut
pl_pl: Tryb touchpada wy³±czony.

source: Click Mode
cs_cz: Re¾im kliknutí
pl_pl: Tryb klikania

source: Left Click
cs_cz: Levé Kliknutí
pl_pl: Klikniêcie LPM

source: Middle Click
cs_cz: Kliknutí prostøedním tlaèítkem
pl_pl: ¦rodkowy przycisk

source: Right Click
cs_cz: Pravé kliknutí
pl_pl: Klikniêcie PPM

source: Hide ScummVM
cs_cz: Skrýt ScummVM
pl_pl: Ukryj ScummVM

source: Hide Others
cs_cz: Skrýt Ostatní
pl_pl: Ukryj pozosta³e

source: Show All
cs_cz: Zobrazit V¹e
pl_pl: Poka¿ wszystkie

source: Window
cs_cz: Okno
pl_pl: Okno

source: Minimize
cs_cz: Minimalizovat
pl_pl: Miniaturka

source: Normal (no scaling)
cs_cz: Normální (bez zmìny velikosti)
pl_pl: Zwyk³y (bez skalowania)

# lowres
source: Normal (no scaling)
cs_cz: Normální (bez zmìny velikosti)
pl_pl: Zwyk³y (bez skalowania)

source: Enabled aspect ratio correction
cs_cz: Povolena korekce pomìru stran
pl_pl: W³±czono korekcjê formatu obrazu

source: Disabled aspect ratio correction
cs_cz: Zakázána korekce pomìru stran
pl_pl: Wy³±czono korekcjê formatu obrazu

source: Active graphics filter:
cs_cz: Aktivní grafický filtr:
pl_pl: Aktywny filtr graficzny:

source: Windowed mode
cs_cz: Re¾im do okna
pl_pl: Okno

source: OpenGL Normal
cs_cz: OpenGL Normální
pl_pl: OpenGL - normalny

source: OpenGL Conserve
cs_cz: OpenGL Zachovávající
pl_pl: OpenGL - zachowanie proporcji

source: OpenGL Original
cs_cz: OpenGL Pùvodní
pl_pl: OpenGL - oryginalny rozmiar

source: Current display mode
cs_cz: Souèasný re¾im obrazu
pl_pl: Obecny tryb wideo

source: Current scale
cs_cz: Souèasná velikost
pl_pl: Aktualne powiêkszenie

source: Active filter mode: Linear
cs_cz: Aktivní re¾im filtru: Lineární
pl_pl: Aktywny tryb filtru: dwuliniowy

source: Active filter mode: Nearest
cs_cz: Aktivní re¾im filtru: Nejbli¾¹í
pl_pl: Aktywny tryb filtru: najbli¿szy s±siad

source: Up
cs_cz: Nahoru
pl_pl: Do góry

source: Down
cs_cz: Dolù
pl_pl: W dó³

source: Left
cs_cz: Doleva
pl_pl: W lewo

source: Right
cs_cz: Doprava
pl_pl: W prawo

source: Zone
cs_cz: Oblast
pl_pl: Strefa

source: Multi Function
cs_cz: Multi Funkce
pl_pl: Wielozadaniowy

source: Swap character
cs_cz: Zamìnit znaky
pl_pl: Zmieñ postaæ

source: Skip text
cs_cz: Pøeskoèit text
pl_pl: Pomiñ tekst

source: Fast mode
cs_cz: Rychlý re¾im
pl_pl: Tryb szybki

source: Debugger
cs_cz: Ladící program

source: Global menu
cs_cz: Globální menu
pl_pl: Menu globalne

source: Virtual keyboard
cs_cz: Virtuální klávesnice
pl_pl: Wirtualna klawiatura

source: Key mapper
cs_cz: Mapovaè kláves
pl_pl: Mapper klawiszy

source: Do you want to quit ?
cs_cz: Chcete ukonèit ?
pl_pl: Chcesz wyj¶æ?

source: Current video mode:
cs_cz: Souèasný re¾im obrazu:
pl_pl: Obecny tryb wideo:

source: Double-strike
cs_cz: Dvojité pøe¹krtnutí
pl_pl: Podwójny atak

source: Horizontal underscan:
cs_cz: Horizontální zmen¹ení
pl_pl: Pionowy underscan:

source: Vertical underscan:
cs_cz: Vertikální zmen¹ení
pl_pl: Poziomy underscan:

source: Input
cs_cz: Vstup
pl_pl: Wej¶cie

source: GC Pad sensitivity:
cs_cz: Citlivost GC Padu
pl_pl: Czu³o¶æ pada GC:

source: GC Pad acceleration:
cs_cz: Zrychlení GC Padu
pl_pl: Przy¶pieszenie pada GC:

source: Status:
cs_cz: Stav:
pl_pl: Stan:

source: Unknown
cs_cz: Neznámé
pl_pl: Nieznany

source: Mount DVD
cs_cz: Pøipojit DVD
pl_pl: Zamontuj DVD

source: Unmount DVD
cs_cz: Odpojit DVD
pl_pl: Odmontuj DVD

source: Share:
cs_cz: Sdílení:
pl_pl: Udzia³:

source: Username:
cs_cz: U¾ivatelské jméno
pl_pl: Nazwa u¿ytkownika:

source: Password:
cs_cz: Heslo
pl_pl: Has³o:

source: Init network
cs_cz: Spustit sí»
pl_pl: Inicjalizacja sieci

source: Mount SMB
cs_cz: Pøipojit SMB
pl_pl: Zamontuj SMB

source: Unmount SMB
cs_cz: Odpojit SMB
pl_pl: Odmontuj SMB

source: DVD Mounted successfully
cs_cz: DVD úspì¹nì pøipojeno
pl_pl: DVD zamontowane pomy¶lnie

source: Error while mounting the DVD
cs_cz: Chyba pøi pøipojování DVD
pl_pl: B³±d przy montowaniu DVD

source: DVD not mounted
cs_cz: DVD nepøipojeno
pl_pl: DVD nie zamontowane

source: Network up, share mounted
cs_cz: Sí» je zapnuta, sdílení pøipojeno
pl_pl: Sieæ dzia³a, udzia³ zamontowany

source: Network up
cs_cz: Sí» je zapnuta
pl_pl: Sieæ dzia³a

source: , error while mounting the share
cs_cz: , chyba pøi pøipojování sdílení
pl_pl: , b³±d podczas montowania udzia³u

source: , share not mounted
cs_cz: , sdílení není pøipojeno
pl_pl: , udzia³ nie zosta³ zamontowany

source: Network down
cs_cz: Sí» je nedostupná
pl_pl: Sieæ nie dzia³a

source: Initializing network
cs_cz: Zavádím sí»
pl_pl: Inicjalizacja sieci

source: Timeout while initializing network
cs_cz: Pøi zavádìní sítì vypr¹el limit
pl_pl: Przekroczono limit czasu inicjalizacji sieci

source: Network not initialized (%d)
cs_cz: Sí» není zavedena (%d)
pl_pl: Sieæ nie zosta³a zainicjalizowana (%d)

source: Hide Toolbar
cs_cz: Skrýt Panel nástrojù
pl_pl: Schowaj pasek narzêdzi

source: Show Keyboard
cs_cz: Zobrazit klávesnici
pl_pl: Poka¿ klawiaturê

source: Sound on/off
cs_cz: Zvuk zapnout/vypnout
pl_pl: W³±cz/wy³±cz d¼wiêk

source: Right click
cs_cz: Pravé kliknutí
pl_pl: Klikniêcie PPM

source: Show/Hide Cursor
cs_cz: Ukázat/Skrýt Kurzor
pl_pl: Poka¿/ukryj kursor

source: Free look
cs_cz: Rozhlí¾ení pomocí my¹i
pl_pl: Swobodne rozgl±danie siê

source: Zoom up
cs_cz: Pøiblí¾ení nahoru
pl_pl: Przybli¿

source: Zoom down
cs_cz: Pøiblí¾ení dolù
pl_pl: Oddal

source: Bind Keys
cs_cz: Pøiøadit klávesy
pl_pl: Przypisz klawisze

source: Cursor Up
cs_cz: ©ipka Nahoru
pl_pl: Kursor do góry

source: Cursor Down
cs_cz: ©ipka Dolù
pl_pl: Kursor w dó³

source: Cursor Left
cs_cz: ©ipka Doleva
pl_pl: Kursor w lewo

source: Cursor Right
cs_cz: ©ipka Doprava
pl_pl: Kursor w prawo

source: Do you want to load or save the game?
cs_cz: Chcete hru nahrát nebo ulo¾it?
pl_pl: Chcesz wczytaæ b±d¼ zapisaæ grê?

source: Are you sure you want to quit ?
cs_cz: Jste si jisti, ¾e chcete odejít ?
pl_pl: Na pewno chcesz wyj¶æ?

source: Keyboard
cs_cz: Klávesnice
pl_pl: Klawiatura

source: Rotate
cs_cz: Otáèet
pl_pl: Obrót

source: Using SDL driver
cs_cz: Pou¾ívá ovladaè SDL
pl_pl: U¿yj sterownika SDL

source: Display
cs_cz: Displej
pl_pl: Obraz

source: Do you want to perform an automatic scan ?
cs_cz: Chcete provést automatické hledání ?
pl_pl: Wykonaæ automatyczne skanowanie?

source: Map right click action
cs_cz: Mapovat èinnost pravé kliknutí
pl_pl: Przypisz dzia³anie PPM

source: You must map a key to the 'Right Click' action to play this game
cs_cz: Musíte namapovat klávesu pro èinnost 'Pravé Kliknutí', abyste tuto hru mohli hrát
pl_pl: Musisz przypisaæ klawisz do 'PPM', by zagraæ w tê grê

source: Map hide toolbar action
cs_cz: Mapovat èinnost skrýt panel nástrojù
pl_pl: Przypisz chowanie paska narzêdzi

source: You must map a key to the 'Hide toolbar' action to play this game
cs_cz: Musíte namapovat klávesu pro èinnost 'Skrýt Panel nástrojù', abyste tuto hru mohli hrát
pl_pl: Musisz przypisaæ przycisk 'Schowaj pasek narzêdzi', by zagraæ w tê grê

source: Map Zoom Up action (optional)
cs_cz: Namapovat èinnost Pøiblí¾it Nahoru (nepovinné)
pl_pl: Przypisz Przybli¿anie (opcjonalne)

source: Map Zoom Down action (optional)
cs_cz: Namapovat èinnost Pøiblí¾it Dolù (nepovinné)
pl_pl: Przypisz Oddalenie (opcjonalne)

source: Don't forget to map a key to 'Hide Toolbar' action to see the whole inventory
cs_cz: Nezapomeòte namapovat klávesu k èinnosti 'Skrýt Panel Nástrojù, abyste vidìli celý inventáø
pl_pl: Nie zapomnij przypisaæ klawisza 'Ukryj pasek narzêdzi', by widzieæ ca³y ekwipunek

source: Do you really want to return to the Launcher?
cs_cz: Opravdu se chcete vrátit tuto do Spou¹tìèe?
pl_pl: Na pewno chcesz powróciæ do launchera?

source: Launcher
cs_cz: Spou¹tìè

source: Do you really want to quit?
cs_cz: Opravdu chcete skonèit?
pl_pl: Na pewno chcesz wyj¶æ?

source: Touchscreen 'Tap Mode' - Left Click
cs_cz: 'Re¾im «uknutí' Dotykové Obrazovky - Levé Kliknutí
pl_pl: Dotkniêcie ekranu - klikniêcie LPM

source: Touchscreen 'Tap Mode' - Right Click
cs_cz: 'Re¾im «uknutí' Dotykové Obrazovky - Pravé Kliknutí
pl_pl: Dotkniêcie ekranu - klikniêcie PPM

source: Touchscreen 'Tap Mode' - Hover (No Click)
cs_cz: 'Re¾im «uknutí' Dotykové Obrazovky - Najetí (Bez Kliknutí)
pl_pl: Dotkniêcie ekranu - brak klikniêcia

source: Maximum Volume
cs_cz: Maximální Hlasitost
pl_pl: Maksymalna g³o¶no¶æ

source: Increasing Volume
cs_cz: Zvy¹uji Hlasitost
pl_pl: Zwiêkszenie g³o¶no¶ci

source: Minimal Volume
cs_cz: Minimální Hlasitost
pl_pl: Minimalna g³o¶no¶æ

source: Decreasing Volume
cs_cz: Sni¾uji Hlasitost
pl_pl: Zmniejszenie g³o¶no¶ci

source: Check for Updates...
cs_cz: Zkontrolovat Aktualizace...
pl_pl: Sprawd¼ aktualizacjê...

source: Right Click Once
cs_cz: Pravé kliknutí jednou
pl_pl: Pojedyncze klikniêcie PPM

source: Move Only
cs_cz: Pouze Pohyb
pl_pl: Tylko ruch

source: Escape Key
cs_cz: Klávesa Escape
pl_pl: Przycisk wyj¶cia

source: Game Menu
cs_cz: Menu Hry
pl_pl: Menu gry

source: Show Keypad
cs_cz: Zobrazit Klávesnici
pl_pl: Poka¿ klawiaturê

source: Control Mouse
cs_cz: Ovládání My¹i
pl_pl: Steruj myszk±

source: Clicking Enabled
cs_cz: Kliknutí Povoleno
pl_pl: Klikanie w³±czone

source: Clicking Disabled
cs_cz: Kliknutí Zakázáno
pl_pl: Klikanie wy³±czone

source: GFX
pl_pl: Grafika

source: Video
pl_pl: Wideo

source: Server:
pl_pl: Serwer:
